MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J99/mcu.h
// Register: RPINR20_21
#define RPINR20_21 RPINR20_21
extern volatile unsigned char           RPINR20_21          __at(0xE34);
#ifndef _LIB_BUILD
asm("RPINR20_21 equ 0E34h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOC2R                  :4;
        unsigned IOC3R                  :4;
    };
    struct {
        unsigned IOC2R0                 :1;
        unsigned IOC2R1                 :1;
        unsigned IOC2R2                 :1;
        unsigned IOC2R3                 :1;
        unsigned IOC3R0                 :1;
        unsigned IOC3R1                 :1;
        unsigned IOC3R2                 :1;
        unsigned IOC3R3                 :1;
    };
} RPINR20_21bits_t;
extern volatile RPINR20_21bits_t RPINR20_21bits __at(0xE34);
// bitfield macros
#define _RPINR20_21_IOC2R_POSN                              0x0
#define _RPINR20_21_IOC2R_POSITION                          0x0
#define _RPINR20_21_IOC2R_SIZE                              0x4
#define _RPINR20_21_IOC2R_LENGTH                            0x4
#define _RPINR20_21_IOC2R_MASK                              0xF
#define _RPINR20_21_IOC3R_POSN                              0x4
#define _RPINR20_21_IOC3R_POSITION                          0x4
#define _RPINR20_21_IOC3R_SIZE                              0x4
#define _RPINR20_21_IOC3R_LENGTH                            0x4
#define _RPINR20_21_IOC3R_MASK                              0xF0
#define _RPINR20_21_IOC2R0_POSN                             0x0
#define _RPINR20_21_IOC2R0_POSITION                         0x0
#define _RPINR20_21_IOC2R0_SIZE                             0x1
#define _RPINR20_21_IOC2R0_LENGTH                           0x1
#define _RPINR20_21_IOC2R0_MASK                             0x1
#define _RPINR20_21_IOC2R1_POSN                             0x1
#define _RPINR20_21_IOC2R1_POSITION                         0x1
#define _RPINR20_21_IOC2R1_SIZE                             0x1
#define _RPINR20_21_IOC2R1_LENGTH                           0x1
#define _RPINR20_21_IOC2R1_MASK                             0x2
#define _RPINR20_21_IOC2R2_POSN                             0x2
#define _RPINR20_21_IOC2R2_POSITION                         0x2
#define _RPINR20_21_IOC2R2_SIZE                             0x1
#define _RPINR20_21_IOC2R2_LENGTH                           0x1
#define _RPINR20_21_IOC2R2_MASK                             0x4
#define _RPINR20_21_IOC2R3_POSN                             0x3
#define _RPINR20_21_IOC2R3_POSITION                         0x3
#define _RPINR20_21_IOC2R3_SIZE                             0x1
#define _RPINR20_21_IOC2R3_LENGTH                           0x1
#define _RPINR20_21_IOC2R3_MASK                             0x8
#define _RPINR20_21_IOC3R0_POSN                             0x4
#define _RPINR20_21_IOC3R0_POSITION                         0x4
#define _RPINR20_21_IOC3R0_SIZE                             0x1
#define _RPINR20_21_IOC3R0_LENGTH                           0x1
#define _RPINR20_21_IOC3R0_MASK                             0x10
#define _RPINR20_21_IOC3R1_POSN                             0x5
#define _RPINR20_21_IOC3R1_POSITION                         0x5
#define _RPINR20_21_IOC3R1_SIZE                             0x1
#define _RPINR20_21_IOC3R1_LENGTH                           0x1
#define _RPINR20_21_IOC3R1_MASK                             0x20
#define _RPINR20_21_IOC3R2_POSN                             0x6
#define _RPINR20_21_IOC3R2_POSITION                         0x6
#define _RPINR20_21_IOC3R2_SIZE                             0x1
#define _RPINR20_21_IOC3R2_LENGTH                           0x1
#define _RPINR20_21_IOC3R2_MASK                             0x40
#define _RPINR20_21_IOC3R3_POSN                             0x7
#define _RPINR20_21_IOC3R3_POSITION                         0x7
#define _RPINR20_21_IOC3R3_SIZE                             0x1
#define _RPINR20_21_IOC3R3_LENGTH                           0x1
#define _RPINR20_21_IOC3R3_MASK                             0x80

// Register: RPINR22_23
#define RPINR22_23 RPINR22_23
extern volatile unsigned char           RPINR22_23          __at(0xE35);
#ifndef _LIB_BUILD
asm("RPINR22_23 equ 0E35h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOC4R                  :4;
        unsigned IOC5R                  :4;
    };
    struct {
        unsigned IOC4R0                 :1;
        unsigned IOC4R1                 :1;
        unsigned IOC4R2                 :1;
        unsigned IOC4R3                 :1;
        unsigned IOC5R0                 :1;
        unsigned IOC5R1                 :1;
        unsigned IOC5R2                 :1;
        unsigned IOC5R3                 :1;
    };
} RPINR22_23bits_t;
extern volatile RPINR22_23bits_t RPINR22_23bits __at(0xE35);
// bitfield macros
#define _RPINR22_23_IOC4R_POSN                              0x0
#define _RPINR22_23_IOC4R_POSITION                          0x0
#define _RPINR22_23_IOC4R_SIZE                              0x4
#define _RPINR22_23_IOC4R_LENGTH                            0x4
#define _RPINR22_23_IOC4R_MASK                              0xF
#define _RPINR22_23_IOC5R_POSN                              0x4
#define _RPINR22_23_IOC5R_POSITION                          0x4
#define _RPINR22_23_IOC5R_SIZE                              0x4
#define _RPINR22_23_IOC5R_LENGTH                            0x4
#define _RPINR22_23_IOC5R_MASK                              0xF0
#define _RPINR22_23_IOC4R0_POSN                             0x0
#define _RPINR22_23_IOC4R0_POSITION                         0x0
#define _RPINR22_23_IOC4R0_SIZE                             0x1
#define _RPINR22_23_IOC4R0_LENGTH                           0x1
#define _RPINR22_23_IOC4R0_MASK                             0x1
#define _RPINR22_23_IOC4R1_POSN                             0x1
#define _RPINR22_23_IOC4R1_POSITION                         0x1
#define _RPINR22_23_IOC4R1_SIZE                             0x1
#define _RPINR22_23_IOC4R1_LENGTH                           0x1
#define _RPINR22_23_IOC4R1_MASK                             0x2
#define _RPINR22_23_IOC4R2_POSN                             0x2
#define _RPINR22_23_IOC4R2_POSITION                         0x2
#define _RPINR22_23_IOC4R2_SIZE                             0x1
#define _RPINR22_23_IOC4R2_LENGTH                           0x1
#define _RPINR22_23_IOC4R2_MASK                             0x4
#define _RPINR22_23_IOC4R3_POSN                             0x3
#define _RPINR22_23_IOC4R3_POSITION                         0x3
#define _RPINR22_23_IOC4R3_SIZE                             0x1
#define _RPINR22_23_IOC4R3_LENGTH                           0x1
#define _RPINR22_23_IOC4R3_MASK                             0x8
#define _RPINR22_23_IOC5R0_POSN                             0x4
#define _RPINR22_23_IOC5R0_POSITION                         0x4
#define _RPINR22_23_IOC5R0_SIZE                             0x1
#define _RPINR22_23_IOC5R0_LENGTH                           0x1
#define _RPINR22_23_IOC5R0_MASK                             0x10
#define _RPINR22_23_IOC5R1_POSN                             0x5
#define _RPINR22_23_IOC5R1_POSITION                         0x5
#define _RPINR22_23_IOC5R1_SIZE                             0x1
#define _RPINR22_23_IOC5R1_LENGTH                           0x1
#define _RPINR22_23_IOC5R1_MASK                             0x20
#define _RPINR22_23_IOC5R2_POSN                             0x6
#define _RPINR22_23_IOC5R2_POSITION                         0x6
#define _RPINR22_23_IOC5R2_SIZE                             0x1
#define _RPINR22_23_IOC5R2_LENGTH                           0x1
#define _RPINR22_23_IOC5R2_MASK                             0x40
#define _RPINR22_23_IOC5R3_POSN                             0x7
#define _RPINR22_23_IOC5R3_POSITION                         0x7
#define _RPINR22_23_IOC5R3_SIZE                             0x1
#define _RPINR22_23_IOC5R3_LENGTH                           0x1
#define _RPINR22_23_IOC5R3_MASK                             0x80

// Register: RPINR24_25
#define RPINR24_25 RPINR24_25
extern volatile unsigned char           RPINR24_25          __at(0xE36);
#ifndef _LIB_BUILD
asm("RPINR24_25 equ 0E36h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOC6R                  :4;
        unsigned IOC7R                  :4;
    };
    struct {
        unsigned IOC6R0                 :1;
        unsigned IOC6R1                 :1;
        unsigned IOC6R2                 :1;
        unsigned IOC6R3                 :1;
        unsigned IOC7R0                 :1;
        unsigned IOC7R1                 :1;
        unsigned IOC7R2                 :1;
        unsigned IOC7R3                 :1;
    };
} RPINR24_25bits_t;
extern volatile RPINR24_25bits_t RPINR24_25bits __at(0xE36);
// bitfield macros
#define _RPINR24_25_IOC6R_POSN                              0x0
#define _RPINR24_25_IOC6R_POSITION                          0x0
#define _RPINR24_25_IOC6R_SIZE                              0x4
#define _RPINR24_25_IOC6R_LENGTH                            0x4
#define _RPINR24_25_IOC6R_MASK                              0xF
#define _RPINR24_25_IOC7R_POSN                              0x4
#define _RPINR24_25_IOC7R_POSITION                          0x4
#define _RPINR24_25_IOC7R_SIZE                              0x4
#define _RPINR24_25_IOC7R_LENGTH                            0x4
#define _RPINR24_25_IOC7R_MASK                              0xF0
#define _RPINR24_25_IOC6R0_POSN                             0x0
#define _RPINR24_25_IOC6R0_POSITION                         0x0
#define _RPINR24_25_IOC6R0_SIZE                             0x1
#define _RPINR24_25_IOC6R0_LENGTH                           0x1
#define _RPINR24_25_IOC6R0_MASK                             0x1
#define _RPINR24_25_IOC6R1_POSN                             0x1
#define _RPINR24_25_IOC6R1_POSITION                         0x1
#define _RPINR24_25_IOC6R1_SIZE                             0x1
#define _RPINR24_25_IOC6R1_LENGTH                           0x1
#define _RPINR24_25_IOC6R1_MASK                             0x2
#define _RPINR24_25_IOC6R2_POSN                             0x2
#define _RPINR24_25_IOC6R2_POSITION                         0x2
#define _RPINR24_25_IOC6R2_SIZE                             0x1
#define _RPINR24_25_IOC6R2_LENGTH                           0x1
#define _RPINR24_25_IOC6R2_MASK                             0x4
#define _RPINR24_25_IOC6R3_POSN                             0x3
#define _RPINR24_25_IOC6R3_POSITION                         0x3
#define _RPINR24_25_IOC6R3_SIZE                             0x1
#define _RPINR24_25_IOC6R3_LENGTH                           0x1
#define _RPINR24_25_IOC6R3_MASK                             0x8
#define _RPINR24_25_IOC7R0_POSN                             0x4
#define _RPINR24_25_IOC7R0_POSITION                         0x4
#define _RPINR24_25_IOC7R0_SIZE                             0x1
#define _RPINR24_25_IOC7R0_LENGTH                           0x1
#define _RPINR24_25_IOC7R0_MASK                             0x10
#define _RPINR24_25_IOC7R1_POSN                             0x5
#define _RPINR24_25_IOC7R1_POSITION                         0x5
#define _RPINR24_25_IOC7R1_SIZE                             0x1
#define _RPINR24_25_IOC7R1_LENGTH                           0x1
#define _RPINR24_25_IOC7R1_MASK                             0x20
#define _RPINR24_25_IOC7R2_POSN                             0x6
#define _RPINR24_25_IOC7R2_POSITION                         0x6
#define _RPINR24_25_IOC7R2_SIZE                             0x1
#define _RPINR24_25_IOC7R2_LENGTH                           0x1
#define _RPINR24_25_IOC7R2_MASK                             0x40
#define _RPINR24_25_IOC7R3_POSN                             0x7
#define _RPINR24_25_IOC7R3_POSITION                         0x7
#define _RPINR24_25_IOC7R3_SIZE                             0x1
#define _RPINR24_25_IOC7R3_LENGTH                           0x1
#define _RPINR24_25_IOC7R3_MASK                             0x80

// Register: RPINR26_27
#define RPINR26_27 RPINR26_27
extern volatile unsigned char           RPINR26_27          __at(0xE37);
#ifndef _LIB_BUILD
asm("RPINR26_27 equ 0E37h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1R                  :4;
        unsigned INT2R                  :4;
    };
    struct {
        unsigned INT1R0                 :1;
        unsigned INT1R1                 :1;
        unsigned INT1R2                 :1;
        unsigned INT1R3                 :1;
        unsigned INT2R0                 :1;
        unsigned INT2R1                 :1;
        unsigned INT2R2                 :1;
        unsigned INT2R3                 :1;
    };
} RPINR26_27bits_t;
extern volatile RPINR26_27bits_t RPINR26_27bits __at(0xE37);
// bitfield macros
#define _RPINR26_27_INT1R_POSN                              0x0
#define _RPINR26_27_INT1R_POSITION                          0x0
#define _RPINR26_27_INT1R_SIZE                              0x4
#define _RPINR26_27_INT1R_LENGTH                            0x4
#define _RPINR26_27_INT1R_MASK                              0xF
#define _RPINR26_27_INT2R_POSN                              0x4
#define _RPINR26_27_INT2R_POSITION                          0x4
#define _RPINR26_27_INT2R_SIZE                              0x4
#define _RPINR26_27_INT2R_LENGTH                            0x4
#define _RPINR26_27_INT2R_MASK                              0xF0
#define _RPINR26_27_INT1R0_POSN                             0x0
#define _RPINR26_27_INT1R0_POSITION                         0x0
#define _RPINR26_27_INT1R0_SIZE                             0x1
#define _RPINR26_27_INT1R0_LENGTH                           0x1
#define _RPINR26_27_INT1R0_MASK                             0x1
#define _RPINR26_27_INT1R1_POSN                             0x1
#define _RPINR26_27_INT1R1_POSITION                         0x1
#define _RPINR26_27_INT1R1_SIZE                             0x1
#define _RPINR26_27_INT1R1_LENGTH                           0x1
#define _RPINR26_27_INT1R1_MASK                             0x2
#define _RPINR26_27_INT1R2_POSN                             0x2
#define _RPINR26_27_INT1R2_POSITION                         0x2
#define _RPINR26_27_INT1R2_SIZE                             0x1
#define _RPINR26_27_INT1R2_LENGTH                           0x1
#define _RPINR26_27_INT1R2_MASK                             0x4
#define _RPINR26_27_INT1R3_POSN                             0x3
#define _RPINR26_27_INT1R3_POSITION                         0x3
#define _RPINR26_27_INT1R3_SIZE                             0x1
#define _RPINR26_27_INT1R3_LENGTH                           0x1
#define _RPINR26_27_INT1R3_MASK                             0x8
#define _RPINR26_27_INT2R0_POSN                             0x4
#define _RPINR26_27_INT2R0_POSITION                         0x4
#define _RPINR26_27_INT2R0_SIZE                             0x1
#define _RPINR26_27_INT2R0_LENGTH                           0x1
#define _RPINR26_27_INT2R0_MASK                             0x10
#define _RPINR26_27_INT2R1_POSN                             0x5
#define _RPINR26_27_INT2R1_POSITION                         0x5
#define _RPINR26_27_INT2R1_SIZE                             0x1
#define _RPINR26_27_INT2R1_LENGTH                           0x1
#define _RPINR26_27_INT2R1_MASK                             0x20
#define _RPINR26_27_INT2R2_POSN                             0x6
#define _RPINR26_27_INT2R2_POSITION                         0x6
#define _RPINR26_27_INT2R2_SIZE                             0x1
#define _RPINR26_27_INT2R2_LENGTH                           0x1
#define _RPINR26_27_INT2R2_MASK                             0x40
#define _RPINR26_27_INT2R3_POSN                             0x7
#define _RPINR26_27_INT2R3_POSITION                         0x7
#define _RPINR26_27_INT2R3_SIZE                             0x1
#define _RPINR26_27_INT2R3_LENGTH                           0x1
#define _RPINR26_27_INT2R3_MASK                             0x80

// Register: RPINR28_29
#define RPINR28_29 RPINR28_29
extern volatile unsigned char           RPINR28_29          __at(0xE38);
#ifndef _LIB_BUILD
asm("RPINR28_29 equ 0E38h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT3R                  :4;
        unsigned MDMINR                 :4;
    };
    struct {
        unsigned INT3R0                 :1;
        unsigned INT3R1                 :1;
        unsigned INT3R2                 :1;
        unsigned INT3R3                 :1;
        unsigned MDMINR0                :1;
        unsigned MDMINR1                :1;
        unsigned MDMINR2                :1;
        unsigned MDMINR3                :1;
    };
} RPINR28_29bits_t;
