MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J99/mcu.h
// Register: ADCBUF1
#define ADCBUF1 ADCBUF1
extern volatile unsigned short          ADCBUF1             __at(0xE48);
#ifndef _LIB_BUILD
asm("ADCBUF1 equ 0E48h");
#endif

// Register: ADCBUF1L
#define ADCBUF1L ADCBUF1L
extern volatile unsigned char           ADCBUF1L            __at(0xE48);
#ifndef _LIB_BUILD
asm("ADCBUF1L equ 0E48h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF1L               :8;
    };
} ADCBUF1Lbits_t;
extern volatile ADCBUF1Lbits_t ADCBUF1Lbits __at(0xE48);
// bitfield macros
#define _ADCBUF1L_ADCBUF1L_POSN                             0x0
#define _ADCBUF1L_ADCBUF1L_POSITION                         0x0
#define _ADCBUF1L_ADCBUF1L_SIZE                             0x8
#define _ADCBUF1L_ADCBUF1L_LENGTH                           0x8
#define _ADCBUF1L_ADCBUF1L_MASK                             0xFF

// Register: ADCBUF1H
#define ADCBUF1H ADCBUF1H
extern volatile unsigned char           ADCBUF1H            __at(0xE49);
#ifndef _LIB_BUILD
asm("ADCBUF1H equ 0E49h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF1H               :8;
    };
} ADCBUF1Hbits_t;
extern volatile ADCBUF1Hbits_t ADCBUF1Hbits __at(0xE49);
// bitfield macros
#define _ADCBUF1H_ADCBUF1H_POSN                             0x0
#define _ADCBUF1H_ADCBUF1H_POSITION                         0x0
#define _ADCBUF1H_ADCBUF1H_SIZE                             0x8
#define _ADCBUF1H_ADCBUF1H_LENGTH                           0x8
#define _ADCBUF1H_ADCBUF1H_MASK                             0xFF

// Register: ADCBUF2
#define ADCBUF2 ADCBUF2
extern volatile unsigned short          ADCBUF2             __at(0xE4A);
#ifndef _LIB_BUILD
asm("ADCBUF2 equ 0E4Ah");
#endif

// Register: ADCBUF2L
#define ADCBUF2L ADCBUF2L
extern volatile unsigned char           ADCBUF2L            __at(0xE4A);
#ifndef _LIB_BUILD
asm("ADCBUF2L equ 0E4Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF2L               :8;
    };
} ADCBUF2Lbits_t;
extern volatile ADCBUF2Lbits_t ADCBUF2Lbits __at(0xE4A);
// bitfield macros
#define _ADCBUF2L_ADCBUF2L_POSN                             0x0
#define _ADCBUF2L_ADCBUF2L_POSITION                         0x0
#define _ADCBUF2L_ADCBUF2L_SIZE                             0x8
#define _ADCBUF2L_ADCBUF2L_LENGTH                           0x8
#define _ADCBUF2L_ADCBUF2L_MASK                             0xFF

// Register: ADCBUF2H
#define ADCBUF2H ADCBUF2H
extern volatile unsigned char           ADCBUF2H            __at(0xE4B);
#ifndef _LIB_BUILD
asm("ADCBUF2H equ 0E4Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF2H               :8;
    };
} ADCBUF2Hbits_t;
extern volatile ADCBUF2Hbits_t ADCBUF2Hbits __at(0xE4B);
// bitfield macros
#define _ADCBUF2H_ADCBUF2H_POSN                             0x0
#define _ADCBUF2H_ADCBUF2H_POSITION                         0x0
#define _ADCBUF2H_ADCBUF2H_SIZE                             0x8
#define _ADCBUF2H_ADCBUF2H_LENGTH                           0x8
#define _ADCBUF2H_ADCBUF2H_MASK                             0xFF

// Register: ADCBUF3
#define ADCBUF3 ADCBUF3
extern volatile unsigned short          ADCBUF3             __at(0xE4C);
#ifndef _LIB_BUILD
asm("ADCBUF3 equ 0E4Ch");
#endif

// Register: ADCBUF3L
#define ADCBUF3L ADCBUF3L
extern volatile unsigned char           ADCBUF3L            __at(0xE4C);
#ifndef _LIB_BUILD
asm("ADCBUF3L equ 0E4Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF3L               :8;
    };
} ADCBUF3Lbits_t;
extern volatile ADCBUF3Lbits_t ADCBUF3Lbits __at(0xE4C);
// bitfield macros
#define _ADCBUF3L_ADCBUF3L_POSN                             0x0
#define _ADCBUF3L_ADCBUF3L_POSITION                         0x0
#define _ADCBUF3L_ADCBUF3L_SIZE                             0x8
#define _ADCBUF3L_ADCBUF3L_LENGTH                           0x8
#define _ADCBUF3L_ADCBUF3L_MASK                             0xFF

// Register: ADCBUF3H
#define ADCBUF3H ADCBUF3H
extern volatile unsigned char           ADCBUF3H            __at(0xE4D);
#ifndef _LIB_BUILD
asm("ADCBUF3H equ 0E4Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF3H               :8;
    };
} ADCBUF3Hbits_t;
extern volatile ADCBUF3Hbits_t ADCBUF3Hbits __at(0xE4D);
// bitfield macros
#define _ADCBUF3H_ADCBUF3H_POSN                             0x0
#define _ADCBUF3H_ADCBUF3H_POSITION                         0x0
#define _ADCBUF3H_ADCBUF3H_SIZE                             0x8
#define _ADCBUF3H_ADCBUF3H_LENGTH                           0x8
#define _ADCBUF3H_ADCBUF3H_MASK                             0xFF

// Register: ADCBUF4
#define ADCBUF4 ADCBUF4
extern volatile unsigned short          ADCBUF4             __at(0xE4E);
#ifndef _LIB_BUILD
asm("ADCBUF4 equ 0E4Eh");
#endif

// Register: ADCBUF4L
#define ADCBUF4L ADCBUF4L
extern volatile unsigned char           ADCBUF4L            __at(0xE4E);
#ifndef _LIB_BUILD
asm("ADCBUF4L equ 0E4Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF4L               :8;
    };
} ADCBUF4Lbits_t;
extern volatile ADCBUF4Lbits_t ADCBUF4Lbits __at(0xE4E);
// bitfield macros
#define _ADCBUF4L_ADCBUF4L_POSN                             0x0
#define _ADCBUF4L_ADCBUF4L_POSITION                         0x0
#define _ADCBUF4L_ADCBUF4L_SIZE                             0x8
#define _ADCBUF4L_ADCBUF4L_LENGTH                           0x8
#define _ADCBUF4L_ADCBUF4L_MASK                             0xFF

// Register: ADCBUF4H
#define ADCBUF4H ADCBUF4H
extern volatile unsigned char           ADCBUF4H            __at(0xE4F);
#ifndef _LIB_BUILD
asm("ADCBUF4H equ 0E4Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF4H               :8;
    };
} ADCBUF4Hbits_t;
extern volatile ADCBUF4Hbits_t ADCBUF4Hbits __at(0xE4F);
// bitfield macros
#define _ADCBUF4H_ADCBUF4H_POSN                             0x0
#define _ADCBUF4H_ADCBUF4H_POSITION                         0x0
#define _ADCBUF4H_ADCBUF4H_SIZE                             0x8
#define _ADCBUF4H_ADCBUF4H_LENGTH                           0x8
#define _ADCBUF4H_ADCBUF4H_MASK                             0xFF

// Register: ADCBUF5
#define ADCBUF5 ADCBUF5
extern volatile unsigned short          ADCBUF5             __at(0xE50);
#ifndef _LIB_BUILD
asm("ADCBUF5 equ 0E50h");
#endif

// Register: ADCBUF5L
#define ADCBUF5L ADCBUF5L
extern volatile unsigned char           ADCBUF5L            __at(0xE50);
#ifndef _LIB_BUILD
asm("ADCBUF5L equ 0E50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF5L               :8;
    };
} ADCBUF5Lbits_t;
extern volatile ADCBUF5Lbits_t ADCBUF5Lbits __at(0xE50);
// bitfield macros
#define _ADCBUF5L_ADCBUF5L_POSN                             0x0
#define _ADCBUF5L_ADCBUF5L_POSITION                         0x0
#define _ADCBUF5L_ADCBUF5L_SIZE                             0x8
#define _ADCBUF5L_ADCBUF5L_LENGTH                           0x8
#define _ADCBUF5L_ADCBUF5L_MASK                             0xFF

