MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J99/mcu.h
// Register: ADCSS0H
#define ADCSS0H ADCSS0H
extern volatile unsigned char           ADCSS0H             __at(0xE83);
#ifndef _LIB_BUILD
asm("ADCSS0H equ 0E83h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSS                    :8;
    };
    struct {
        unsigned CSS8                   :1;
        unsigned CSS9                   :1;
        unsigned CSS10                  :1;
        unsigned CSS11                  :1;
        unsigned CSS12                  :1;
        unsigned CSS13                  :1;
        unsigned CSS14                  :1;
        unsigned CSS15                  :1;
    };
} ADCSS0Hbits_t;
extern volatile ADCSS0Hbits_t ADCSS0Hbits __at(0xE83);
// bitfield macros
#define _ADCSS0H_CSS_POSN                                   0x0
#define _ADCSS0H_CSS_POSITION                               0x0
#define _ADCSS0H_CSS_SIZE                                   0x8
#define _ADCSS0H_CSS_LENGTH                                 0x8
#define _ADCSS0H_CSS_MASK                                   0xFF
#define _ADCSS0H_CSS8_POSN                                  0x0
#define _ADCSS0H_CSS8_POSITION                              0x0
#define _ADCSS0H_CSS8_SIZE                                  0x1
#define _ADCSS0H_CSS8_LENGTH                                0x1
#define _ADCSS0H_CSS8_MASK                                  0x1
#define _ADCSS0H_CSS9_POSN                                  0x1
#define _ADCSS0H_CSS9_POSITION                              0x1
#define _ADCSS0H_CSS9_SIZE                                  0x1
#define _ADCSS0H_CSS9_LENGTH                                0x1
#define _ADCSS0H_CSS9_MASK                                  0x2
#define _ADCSS0H_CSS10_POSN                                 0x2
#define _ADCSS0H_CSS10_POSITION                             0x2
#define _ADCSS0H_CSS10_SIZE                                 0x1
#define _ADCSS0H_CSS10_LENGTH                               0x1
#define _ADCSS0H_CSS10_MASK                                 0x4
#define _ADCSS0H_CSS11_POSN                                 0x3
#define _ADCSS0H_CSS11_POSITION                             0x3
#define _ADCSS0H_CSS11_SIZE                                 0x1
#define _ADCSS0H_CSS11_LENGTH                               0x1
#define _ADCSS0H_CSS11_MASK                                 0x8
#define _ADCSS0H_CSS12_POSN                                 0x4
#define _ADCSS0H_CSS12_POSITION                             0x4
#define _ADCSS0H_CSS12_SIZE                                 0x1
#define _ADCSS0H_CSS12_LENGTH                               0x1
#define _ADCSS0H_CSS12_MASK                                 0x10
#define _ADCSS0H_CSS13_POSN                                 0x5
#define _ADCSS0H_CSS13_POSITION                             0x5
#define _ADCSS0H_CSS13_SIZE                                 0x1
#define _ADCSS0H_CSS13_LENGTH                               0x1
#define _ADCSS0H_CSS13_MASK                                 0x20
#define _ADCSS0H_CSS14_POSN                                 0x6
#define _ADCSS0H_CSS14_POSITION                             0x6
#define _ADCSS0H_CSS14_SIZE                                 0x1
#define _ADCSS0H_CSS14_LENGTH                               0x1
#define _ADCSS0H_CSS14_MASK                                 0x40
#define _ADCSS0H_CSS15_POSN                                 0x7
#define _ADCSS0H_CSS15_POSITION                             0x7
#define _ADCSS0H_CSS15_SIZE                                 0x1
#define _ADCSS0H_CSS15_LENGTH                               0x1
#define _ADCSS0H_CSS15_MASK                                 0x80

// Register: ADCSS1L
#define ADCSS1L ADCSS1L
extern volatile unsigned char           ADCSS1L             __at(0xE84);
#ifndef _LIB_BUILD
asm("ADCSS1L equ 0E84h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSS                    :8;
    };
    struct {
        unsigned CSS16                  :1;
        unsigned CSS17                  :1;
        unsigned CSS18                  :1;
        unsigned CSS19                  :1;
        unsigned CSS20                  :1;
        unsigned CSS21                  :1;
        unsigned CSS22                  :1;
        unsigned CSS23                  :1;
    };
} ADCSS1Lbits_t;
extern volatile ADCSS1Lbits_t ADCSS1Lbits __at(0xE84);
// bitfield macros
#define _ADCSS1L_CSS_POSN                                   0x0
#define _ADCSS1L_CSS_POSITION                               0x0
#define _ADCSS1L_CSS_SIZE                                   0x8
#define _ADCSS1L_CSS_LENGTH                                 0x8
#define _ADCSS1L_CSS_MASK                                   0xFF
#define _ADCSS1L_CSS16_POSN                                 0x0
#define _ADCSS1L_CSS16_POSITION                             0x0
#define _ADCSS1L_CSS16_SIZE                                 0x1
#define _ADCSS1L_CSS16_LENGTH                               0x1
#define _ADCSS1L_CSS16_MASK                                 0x1
#define _ADCSS1L_CSS17_POSN                                 0x1
#define _ADCSS1L_CSS17_POSITION                             0x1
#define _ADCSS1L_CSS17_SIZE                                 0x1
#define _ADCSS1L_CSS17_LENGTH                               0x1
#define _ADCSS1L_CSS17_MASK                                 0x2
#define _ADCSS1L_CSS18_POSN                                 0x2
#define _ADCSS1L_CSS18_POSITION                             0x2
#define _ADCSS1L_CSS18_SIZE                                 0x1
#define _ADCSS1L_CSS18_LENGTH                               0x1
#define _ADCSS1L_CSS18_MASK                                 0x4
#define _ADCSS1L_CSS19_POSN                                 0x3
#define _ADCSS1L_CSS19_POSITION                             0x3
#define _ADCSS1L_CSS19_SIZE                                 0x1
#define _ADCSS1L_CSS19_LENGTH                               0x1
#define _ADCSS1L_CSS19_MASK                                 0x8
#define _ADCSS1L_CSS20_POSN                                 0x4
#define _ADCSS1L_CSS20_POSITION                             0x4
#define _ADCSS1L_CSS20_SIZE                                 0x1
#define _ADCSS1L_CSS20_LENGTH                               0x1
#define _ADCSS1L_CSS20_MASK                                 0x10
#define _ADCSS1L_CSS21_POSN                                 0x5
#define _ADCSS1L_CSS21_POSITION                             0x5
#define _ADCSS1L_CSS21_SIZE                                 0x1
#define _ADCSS1L_CSS21_LENGTH                               0x1
#define _ADCSS1L_CSS21_MASK                                 0x20
#define _ADCSS1L_CSS22_POSN                                 0x6
#define _ADCSS1L_CSS22_POSITION                             0x6
#define _ADCSS1L_CSS22_SIZE                                 0x1
#define _ADCSS1L_CSS22_LENGTH                               0x1
#define _ADCSS1L_CSS22_MASK                                 0x40
#define _ADCSS1L_CSS23_POSN                                 0x7
#define _ADCSS1L_CSS23_POSITION                             0x7
#define _ADCSS1L_CSS23_SIZE                                 0x1
#define _ADCSS1L_CSS23_LENGTH                               0x1
#define _ADCSS1L_CSS23_MASK                                 0x80

// Register: ADCSS1H
#define ADCSS1H ADCSS1H
extern volatile unsigned char           ADCSS1H             __at(0xE85);
#ifndef _LIB_BUILD
asm("ADCSS1H equ 0E85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSS                    :8;
    };
    struct {
        unsigned CSS24                  :1;
        unsigned CSS25                  :1;
        unsigned CSS26                  :1;
        unsigned CSS27                  :1;
        unsigned CSS28                  :1;
        unsigned CSS29                  :1;
        unsigned CSS30                  :1;
    };
} ADCSS1Hbits_t;
extern volatile ADCSS1Hbits_t ADCSS1Hbits __at(0xE85);
// bitfield macros
#define _ADCSS1H_CSS_POSN                                   0x0
#define _ADCSS1H_CSS_POSITION                               0x0
#define _ADCSS1H_CSS_SIZE                                   0x8
#define _ADCSS1H_CSS_LENGTH                                 0x8
#define _ADCSS1H_CSS_MASK                                   0xFF
#define _ADCSS1H_CSS24_POSN                                 0x0
#define _ADCSS1H_CSS24_POSITION                             0x0
#define _ADCSS1H_CSS24_SIZE                                 0x1
#define _ADCSS1H_CSS24_LENGTH                               0x1
#define _ADCSS1H_CSS24_MASK                                 0x1
#define _ADCSS1H_CSS25_POSN                                 0x1
#define _ADCSS1H_CSS25_POSITION                             0x1
#define _ADCSS1H_CSS25_SIZE                                 0x1
#define _ADCSS1H_CSS25_LENGTH                               0x1
#define _ADCSS1H_CSS25_MASK                                 0x2
#define _ADCSS1H_CSS26_POSN                                 0x2
#define _ADCSS1H_CSS26_POSITION                             0x2
#define _ADCSS1H_CSS26_SIZE                                 0x1
#define _ADCSS1H_CSS26_LENGTH                               0x1
#define _ADCSS1H_CSS26_MASK                                 0x4
#define _ADCSS1H_CSS27_POSN                                 0x3
#define _ADCSS1H_CSS27_POSITION                             0x3
#define _ADCSS1H_CSS27_SIZE                                 0x1
#define _ADCSS1H_CSS27_LENGTH                               0x1
#define _ADCSS1H_CSS27_MASK                                 0x8
#define _ADCSS1H_CSS28_POSN                                 0x4
#define _ADCSS1H_CSS28_POSITION                             0x4
#define _ADCSS1H_CSS28_SIZE                                 0x1
#define _ADCSS1H_CSS28_LENGTH                               0x1
#define _ADCSS1H_CSS28_MASK                                 0x10
#define _ADCSS1H_CSS29_POSN                                 0x5
#define _ADCSS1H_CSS29_POSITION                             0x5
#define _ADCSS1H_CSS29_SIZE                                 0x1
#define _ADCSS1H_CSS29_LENGTH                               0x1
#define _ADCSS1H_CSS29_MASK                                 0x20
#define _ADCSS1H_CSS30_POSN                                 0x6
#define _ADCSS1H_CSS30_POSITION                             0x6
#define _ADCSS1H_CSS30_SIZE                                 0x1
#define _ADCSS1H_CSS30_LENGTH                               0x1
#define _ADCSS1H_CSS30_MASK                                 0x40

// Register: ADCHS0L
#define ADCHS0L ADCHS0L
extern volatile unsigned char           ADCHS0L             __at(0xE86);
#ifndef _LIB_BUILD
asm("ADCHS0L equ 0E86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH0SA                  :5;
        unsigned CH0NA                  :3;
    };
    struct {
        unsigned CH0SA0                 :1;
        unsigned CH0SA1                 :1;
        unsigned CH0SA2                 :1;
        unsigned CH0SA3                 :1;
        unsigned CH0SA4                 :1;
        unsigned CH0NA0                 :1;
        unsigned CH0NA1                 :1;
        unsigned CH0NA2                 :1;
    };
} ADCHS0Lbits_t;
extern volatile ADCHS0Lbits_t ADCHS0Lbits __at(0xE86);
// bitfield macros
#define _ADCHS0L_CH0SA_POSN                                 0x0
#define _ADCHS0L_CH0SA_POSITION                             0x0
#define _ADCHS0L_CH0SA_SIZE                                 0x5
#define _ADCHS0L_CH0SA_LENGTH                               0x5
#define _ADCHS0L_CH0SA_MASK                                 0x1F
#define _ADCHS0L_CH0NA_POSN                                 0x5
#define _ADCHS0L_CH0NA_POSITION                             0x5
#define _ADCHS0L_CH0NA_SIZE                                 0x3
#define _ADCHS0L_CH0NA_LENGTH                               0x3
#define _ADCHS0L_CH0NA_MASK                                 0xE0
#define _ADCHS0L_CH0SA0_POSN                                0x0
#define _ADCHS0L_CH0SA0_POSITION                            0x0
#define _ADCHS0L_CH0SA0_SIZE                                0x1
#define _ADCHS0L_CH0SA0_LENGTH                              0x1
#define _ADCHS0L_CH0SA0_MASK                                0x1
#define _ADCHS0L_CH0SA1_POSN                                0x1
#define _ADCHS0L_CH0SA1_POSITION                            0x1
#define _ADCHS0L_CH0SA1_SIZE                                0x1
#define _ADCHS0L_CH0SA1_LENGTH                              0x1
#define _ADCHS0L_CH0SA1_MASK                                0x2
#define _ADCHS0L_CH0SA2_POSN                                0x2
#define _ADCHS0L_CH0SA2_POSITION                            0x2
#define _ADCHS0L_CH0SA2_SIZE                                0x1
#define _ADCHS0L_CH0SA2_LENGTH                              0x1
#define _ADCHS0L_CH0SA2_MASK                                0x4
#define _ADCHS0L_CH0SA3_POSN                                0x3
#define _ADCHS0L_CH0SA3_POSITION                            0x3
#define _ADCHS0L_CH0SA3_SIZE                                0x1
#define _ADCHS0L_CH0SA3_LENGTH                              0x1
#define _ADCHS0L_CH0SA3_MASK                                0x8
#define _ADCHS0L_CH0SA4_POSN                                0x4
#define _ADCHS0L_CH0SA4_POSITION                            0x4
#define _ADCHS0L_CH0SA4_SIZE                                0x1
#define _ADCHS0L_CH0SA4_LENGTH                              0x1
#define _ADCHS0L_CH0SA4_MASK                                0x10
#define _ADCHS0L_CH0NA0_POSN                                0x5
#define _ADCHS0L_CH0NA0_POSITION                            0x5
#define _ADCHS0L_CH0NA0_SIZE                                0x1
#define _ADCHS0L_CH0NA0_LENGTH                              0x1
#define _ADCHS0L_CH0NA0_MASK                                0x20
#define _ADCHS0L_CH0NA1_POSN                                0x6
#define _ADCHS0L_CH0NA1_POSITION                            0x6
#define _ADCHS0L_CH0NA1_SIZE                                0x1
#define _ADCHS0L_CH0NA1_LENGTH                              0x1
#define _ADCHS0L_CH0NA1_MASK                                0x40
#define _ADCHS0L_CH0NA2_POSN                                0x7
#define _ADCHS0L_CH0NA2_POSITION                            0x7
#define _ADCHS0L_CH0NA2_SIZE                                0x1
#define _ADCHS0L_CH0NA2_LENGTH                              0x1
#define _ADCHS0L_CH0NA2_MASK                                0x80

// Register: ADCHS0H
#define ADCHS0H ADCHS0H
extern volatile unsigned char           ADCHS0H             __at(0xE87);
#ifndef _LIB_BUILD
asm("ADCHS0H equ 0E87h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH0SB                  :5;
        unsigned CH0NB                  :3;
    };
    struct {
        unsigned CH0SB0                 :1;
        unsigned CH0SB1                 :1;
        unsigned CH0SB2                 :1;
        unsigned CH0SB3                 :1;
        unsigned CH0SB4                 :1;
        unsigned CH0NB0                 :1;
        unsigned CH0NB1                 :1;
        unsigned CH0NB2                 :1;
    };
} ADCHS0Hbits_t;
extern volatile ADCHS0Hbits_t ADCHS0Hbits __at(0xE87);
// bitfield macros
#define _ADCHS0H_CH0SB_POSN                                 0x0
#define _ADCHS0H_CH0SB_POSITION                             0x0
#define _ADCHS0H_CH0SB_SIZE                                 0x5
#define _ADCHS0H_CH0SB_LENGTH                               0x5
#define _ADCHS0H_CH0SB_MASK                                 0x1F
#define _ADCHS0H_CH0NB_POSN                                 0x5
#define _ADCHS0H_CH0NB_POSITION                             0x5
#define _ADCHS0H_CH0NB_SIZE                                 0x3
#define _ADCHS0H_CH0NB_LENGTH                               0x3
#define _ADCHS0H_CH0NB_MASK                                 0xE0
#define _ADCHS0H_CH0SB0_POSN                                0x0
#define _ADCHS0H_CH0SB0_POSITION                            0x0
#define _ADCHS0H_CH0SB0_SIZE                                0x1
#define _ADCHS0H_CH0SB0_LENGTH                              0x1
#define _ADCHS0H_CH0SB0_MASK                                0x1
#define _ADCHS0H_CH0SB1_POSN                                0x1
#define _ADCHS0H_CH0SB1_POSITION                            0x1
#define _ADCHS0H_CH0SB1_SIZE                                0x1
#define _ADCHS0H_CH0SB1_LENGTH                              0x1
#define _ADCHS0H_CH0SB1_MASK                                0x2
#define _ADCHS0H_CH0SB2_POSN                                0x2
#define _ADCHS0H_CH0SB2_POSITION                            0x2
#define _ADCHS0H_CH0SB2_SIZE                                0x1
#define _ADCHS0H_CH0SB2_LENGTH                              0x1
#define _ADCHS0H_CH0SB2_MASK                                0x4
#define _ADCHS0H_CH0SB3_POSN                                0x3
#define _ADCHS0H_CH0SB3_POSITION                            0x3
#define _ADCHS0H_CH0SB3_SIZE                                0x1
#define _ADCHS0H_CH0SB3_LENGTH                              0x1
#define _ADCHS0H_CH0SB3_MASK                                0x8
#define _ADCHS0H_CH0SB4_POSN                                0x4
#define _ADCHS0H_CH0SB4_POSITION                            0x4
#define _ADCHS0H_CH0SB4_SIZE                                0x1
#define _ADCHS0H_CH0SB4_LENGTH                              0x1
#define _ADCHS0H_CH0SB4_MASK                                0x10
#define _ADCHS0H_CH0NB0_POSN                                0x5
#define _ADCHS0H_CH0NB0_POSITION                            0x5
#define _ADCHS0H_CH0NB0_SIZE                                0x1
#define _ADCHS0H_CH0NB0_LENGTH                              0x1
#define _ADCHS0H_CH0NB0_MASK                                0x20
#define _ADCHS0H_CH0NB1_POSN                                0x6
#define _ADCHS0H_CH0NB1_POSITION                            0x6
#define _ADCHS0H_CH0NB1_SIZE                                0x1
#define _ADCHS0H_CH0NB1_LENGTH                              0x1
#define _ADCHS0H_CH0NB1_MASK                                0x40
#define _ADCHS0H_CH0NB2_POSN                                0x7
#define _ADCHS0H_CH0NB2_POSITION                            0x7
#define _ADCHS0H_CH0NB2_SIZE                                0x1
#define _ADCHS0H_CH0NB2_LENGTH                              0x1
#define _ADCHS0H_CH0NB2_MASK                                0x80

