MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J99/mcu.h
// Register: ADCON5L
#define ADCON5L ADCON5L
extern volatile unsigned char           ADCON5L             __at(0xE88);
#ifndef _LIB_BUILD
asm("ADCON5L equ 0E88h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CM                     :2;
        unsigned WM                     :2;
    };
    struct {
        unsigned CM0                    :1;
        unsigned CM1                    :1;
        unsigned WM0                    :1;
        unsigned WM1                    :1;
    };
} ADCON5Lbits_t;
extern volatile ADCON5Lbits_t ADCON5Lbits __at(0xE88);
// bitfield macros
#define _ADCON5L_CM_POSN                                    0x0
#define _ADCON5L_CM_POSITION                                0x0
#define _ADCON5L_CM_SIZE                                    0x2
#define _ADCON5L_CM_LENGTH                                  0x2
#define _ADCON5L_CM_MASK                                    0x3
#define _ADCON5L_WM_POSN                                    0x2
#define _ADCON5L_WM_POSITION                                0x2
#define _ADCON5L_WM_SIZE                                    0x2
#define _ADCON5L_WM_LENGTH                                  0x2
#define _ADCON5L_WM_MASK                                    0xC
#define _ADCON5L_CM0_POSN                                   0x0
#define _ADCON5L_CM0_POSITION                               0x0
#define _ADCON5L_CM0_SIZE                                   0x1
#define _ADCON5L_CM0_LENGTH                                 0x1
#define _ADCON5L_CM0_MASK                                   0x1
#define _ADCON5L_CM1_POSN                                   0x1
#define _ADCON5L_CM1_POSITION                               0x1
#define _ADCON5L_CM1_SIZE                                   0x1
#define _ADCON5L_CM1_LENGTH                                 0x1
#define _ADCON5L_CM1_MASK                                   0x2
#define _ADCON5L_WM0_POSN                                   0x2
#define _ADCON5L_WM0_POSITION                               0x2
#define _ADCON5L_WM0_SIZE                                   0x1
#define _ADCON5L_WM0_LENGTH                                 0x1
#define _ADCON5L_WM0_MASK                                   0x4
#define _ADCON5L_WM1_POSN                                   0x3
#define _ADCON5L_WM1_POSITION                               0x3
#define _ADCON5L_WM1_SIZE                                   0x1
#define _ADCON5L_WM1_LENGTH                                 0x1
#define _ADCON5L_WM1_MASK                                   0x8

// Register: ADCON5H
#define ADCON5H ADCON5H
extern volatile unsigned char           ADCON5H             __at(0xE89);
#ifndef _LIB_BUILD
asm("ADCON5H equ 0E89h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ASINTMD                :2;
        unsigned                        :3;
        unsigned CTMUREQ                :1;
        unsigned LPENA                  :1;
        unsigned ASENA                  :1;
    };
    struct {
        unsigned ASINTMD0               :1;
        unsigned ASINTMD1               :1;
    };
} ADCON5Hbits_t;
extern volatile ADCON5Hbits_t ADCON5Hbits __at(0xE89);
// bitfield macros
#define _ADCON5H_ASINTMD_POSN                               0x0
#define _ADCON5H_ASINTMD_POSITION                           0x0
#define _ADCON5H_ASINTMD_SIZE                               0x2
#define _ADCON5H_ASINTMD_LENGTH                             0x2
#define _ADCON5H_ASINTMD_MASK                               0x3
#define _ADCON5H_CTMUREQ_POSN                               0x5
#define _ADCON5H_CTMUREQ_POSITION                           0x5
#define _ADCON5H_CTMUREQ_SIZE                               0x1
#define _ADCON5H_CTMUREQ_LENGTH                             0x1
#define _ADCON5H_CTMUREQ_MASK                               0x20
#define _ADCON5H_LPENA_POSN                                 0x6
#define _ADCON5H_LPENA_POSITION                             0x6
#define _ADCON5H_LPENA_SIZE                                 0x1
#define _ADCON5H_LPENA_LENGTH                               0x1
#define _ADCON5H_LPENA_MASK                                 0x40
#define _ADCON5H_ASENA_POSN                                 0x7
#define _ADCON5H_ASENA_POSITION                             0x7
#define _ADCON5H_ASENA_SIZE                                 0x1
#define _ADCON5H_ASENA_LENGTH                               0x1
#define _ADCON5H_ASENA_MASK                                 0x80
#define _ADCON5H_ASINTMD0_POSN                              0x0
#define _ADCON5H_ASINTMD0_POSITION                          0x0
#define _ADCON5H_ASINTMD0_SIZE                              0x1
#define _ADCON5H_ASINTMD0_LENGTH                            0x1
#define _ADCON5H_ASINTMD0_MASK                              0x1
#define _ADCON5H_ASINTMD1_POSN                              0x1
#define _ADCON5H_ASINTMD1_POSITION                          0x1
#define _ADCON5H_ASINTMD1_SIZE                              0x1
#define _ADCON5H_ASINTMD1_LENGTH                            0x1
#define _ADCON5H_ASINTMD1_MASK                              0x2

// Register: ADCON3L
#define ADCON3L ADCON3L
extern volatile unsigned char           ADCON3L             __at(0xE8A);
#ifndef _LIB_BUILD
asm("ADCON3L equ 0E8Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCS                   :8;
    };
    struct {
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
        unsigned ADCS3                  :1;
        unsigned ADCS4                  :1;
        unsigned ADCS5                  :1;
        unsigned ADCS6                  :1;
        unsigned ADCS7                  :1;
    };
} ADCON3Lbits_t;
extern volatile ADCON3Lbits_t ADCON3Lbits __at(0xE8A);
// bitfield macros
#define _ADCON3L_ADCS_POSN                                  0x0
#define _ADCON3L_ADCS_POSITION                              0x0
#define _ADCON3L_ADCS_SIZE                                  0x8
#define _ADCON3L_ADCS_LENGTH                                0x8
#define _ADCON3L_ADCS_MASK                                  0xFF
#define _ADCON3L_ADCS0_POSN                                 0x0
#define _ADCON3L_ADCS0_POSITION                             0x0
#define _ADCON3L_ADCS0_SIZE                                 0x1
#define _ADCON3L_ADCS0_LENGTH                               0x1
#define _ADCON3L_ADCS0_MASK                                 0x1
#define _ADCON3L_ADCS1_POSN                                 0x1
#define _ADCON3L_ADCS1_POSITION                             0x1
#define _ADCON3L_ADCS1_SIZE                                 0x1
#define _ADCON3L_ADCS1_LENGTH                               0x1
#define _ADCON3L_ADCS1_MASK                                 0x2
#define _ADCON3L_ADCS2_POSN                                 0x2
#define _ADCON3L_ADCS2_POSITION                             0x2
#define _ADCON3L_ADCS2_SIZE                                 0x1
#define _ADCON3L_ADCS2_LENGTH                               0x1
#define _ADCON3L_ADCS2_MASK                                 0x4
#define _ADCON3L_ADCS3_POSN                                 0x3
#define _ADCON3L_ADCS3_POSITION                             0x3
#define _ADCON3L_ADCS3_SIZE                                 0x1
#define _ADCON3L_ADCS3_LENGTH                               0x1
#define _ADCON3L_ADCS3_MASK                                 0x8
#define _ADCON3L_ADCS4_POSN                                 0x4
#define _ADCON3L_ADCS4_POSITION                             0x4
#define _ADCON3L_ADCS4_SIZE                                 0x1
#define _ADCON3L_ADCS4_LENGTH                               0x1
#define _ADCON3L_ADCS4_MASK                                 0x10
#define _ADCON3L_ADCS5_POSN                                 0x5
#define _ADCON3L_ADCS5_POSITION                             0x5
#define _ADCON3L_ADCS5_SIZE                                 0x1
#define _ADCON3L_ADCS5_LENGTH                               0x1
#define _ADCON3L_ADCS5_MASK                                 0x20
#define _ADCON3L_ADCS6_POSN                                 0x6
#define _ADCON3L_ADCS6_POSITION                             0x6
#define _ADCON3L_ADCS6_SIZE                                 0x1
#define _ADCON3L_ADCS6_LENGTH                               0x1
#define _ADCON3L_ADCS6_MASK                                 0x40
#define _ADCON3L_ADCS7_POSN                                 0x7
#define _ADCON3L_ADCS7_POSITION                             0x7
#define _ADCON3L_ADCS7_SIZE                                 0x1
#define _ADCON3L_ADCS7_LENGTH                               0x1
#define _ADCON3L_ADCS7_MASK                                 0x80

// Register: ADCON3H
#define ADCON3H ADCON3H
extern volatile unsigned char           ADCON3H             __at(0xE8B);
#ifndef _LIB_BUILD
asm("ADCON3H equ 0E8Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SAMC                   :5;
        unsigned PUMPEN                 :1;
        unsigned EXTSAM                 :1;
        unsigned ADRC                   :1;
    };
    struct {
        unsigned SAMC0                  :1;
        unsigned SAMC1                  :1;
        unsigned SAMC2                  :1;
        unsigned SAMC3                  :1;
        unsigned SAMC4                  :1;
    };
} ADCON3Hbits_t;
extern volatile ADCON3Hbits_t ADCON3Hbits __at(0xE8B);
// bitfield macros
#define _ADCON3H_SAMC_POSN                                  0x0
#define _ADCON3H_SAMC_POSITION                              0x0
#define _ADCON3H_SAMC_SIZE                                  0x5
#define _ADCON3H_SAMC_LENGTH                                0x5
#define _ADCON3H_SAMC_MASK                                  0x1F
#define _ADCON3H_PUMPEN_POSN                                0x5
#define _ADCON3H_PUMPEN_POSITION                            0x5
#define _ADCON3H_PUMPEN_SIZE                                0x1
#define _ADCON3H_PUMPEN_LENGTH                              0x1
#define _ADCON3H_PUMPEN_MASK                                0x20
#define _ADCON3H_EXTSAM_POSN                                0x6
#define _ADCON3H_EXTSAM_POSITION                            0x6
#define _ADCON3H_EXTSAM_SIZE                                0x1
#define _ADCON3H_EXTSAM_LENGTH                              0x1
#define _ADCON3H_EXTSAM_MASK                                0x40
#define _ADCON3H_ADRC_POSN                                  0x7
#define _ADCON3H_ADRC_POSITION                              0x7
#define _ADCON3H_ADRC_SIZE                                  0x1
#define _ADCON3H_ADRC_LENGTH                                0x1
#define _ADCON3H_ADRC_MASK                                  0x80
#define _ADCON3H_SAMC0_POSN                                 0x0
#define _ADCON3H_SAMC0_POSITION                             0x0
#define _ADCON3H_SAMC0_SIZE                                 0x1
#define _ADCON3H_SAMC0_LENGTH                               0x1
#define _ADCON3H_SAMC0_MASK                                 0x1
#define _ADCON3H_SAMC1_POSN                                 0x1
#define _ADCON3H_SAMC1_POSITION                             0x1
#define _ADCON3H_SAMC1_SIZE                                 0x1
#define _ADCON3H_SAMC1_LENGTH                               0x1
#define _ADCON3H_SAMC1_MASK                                 0x2
#define _ADCON3H_SAMC2_POSN                                 0x2
#define _ADCON3H_SAMC2_POSITION                             0x2
#define _ADCON3H_SAMC2_SIZE                                 0x1
#define _ADCON3H_SAMC2_LENGTH                               0x1
#define _ADCON3H_SAMC2_MASK                                 0x4
#define _ADCON3H_SAMC3_POSN                                 0x3
#define _ADCON3H_SAMC3_POSITION                             0x3
#define _ADCON3H_SAMC3_SIZE                                 0x1
#define _ADCON3H_SAMC3_LENGTH                               0x1
#define _ADCON3H_SAMC3_MASK                                 0x8
#define _ADCON3H_SAMC4_POSN                                 0x4
#define _ADCON3H_SAMC4_POSITION                             0x4
#define _ADCON3H_SAMC4_SIZE                                 0x1
#define _ADCON3H_SAMC4_LENGTH                               0x1
#define _ADCON3H_SAMC4_MASK                                 0x10

// Register: ADCON2L
#define ADCON2L ADCON2L
extern volatile unsigned char           ADCON2L             __at(0xE8C);
#ifndef _LIB_BUILD
asm("ADCON2L equ 0E8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ALTS                   :1;
        unsigned BUFM                   :1;
        unsigned SMPI                   :5;
        unsigned BUFS                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned SMPI0                  :1;
        unsigned SMPI1                  :1;
        unsigned SMPI2                  :1;
        unsigned SMPI3                  :1;
        unsigned SMPI4                  :1;
    };
} ADCON2Lbits_t;
extern volatile ADCON2Lbits_t ADCON2Lbits __at(0xE8C);
// bitfield macros
#define _ADCON2L_ALTS_POSN                                  0x0
#define _ADCON2L_ALTS_POSITION                              0x0
#define _ADCON2L_ALTS_SIZE                                  0x1
#define _ADCON2L_ALTS_LENGTH                                0x1
#define _ADCON2L_ALTS_MASK                                  0x1
#define _ADCON2L_BUFM_POSN                                  0x1
#define _ADCON2L_BUFM_POSITION                              0x1
#define _ADCON2L_BUFM_SIZE                                  0x1
#define _ADCON2L_BUFM_LENGTH                                0x1
#define _ADCON2L_BUFM_MASK                                  0x2
#define _ADCON2L_SMPI_POSN                                  0x2
#define _ADCON2L_SMPI_POSITION                              0x2
#define _ADCON2L_SMPI_SIZE                                  0x5
#define _ADCON2L_SMPI_LENGTH                                0x5
#define _ADCON2L_SMPI_MASK                                  0x7C
#define _ADCON2L_BUFS_POSN                                  0x7
#define _ADCON2L_BUFS_POSITION                              0x7
#define _ADCON2L_BUFS_SIZE                                  0x1
#define _ADCON2L_BUFS_LENGTH                                0x1
#define _ADCON2L_BUFS_MASK                                  0x80
#define _ADCON2L_SMPI0_POSN                                 0x2
#define _ADCON2L_SMPI0_POSITION                             0x2
#define _ADCON2L_SMPI0_SIZE                                 0x1
#define _ADCON2L_SMPI0_LENGTH                               0x1
#define _ADCON2L_SMPI0_MASK                                 0x4
#define _ADCON2L_SMPI1_POSN                                 0x3
#define _ADCON2L_SMPI1_POSITION                             0x3
#define _ADCON2L_SMPI1_SIZE                                 0x1
#define _ADCON2L_SMPI1_LENGTH                               0x1
#define _ADCON2L_SMPI1_MASK                                 0x8
#define _ADCON2L_SMPI2_POSN                                 0x4
#define _ADCON2L_SMPI2_POSITION                             0x4
#define _ADCON2L_SMPI2_SIZE                                 0x1
#define _ADCON2L_SMPI2_LENGTH                               0x1
#define _ADCON2L_SMPI2_MASK                                 0x10
#define _ADCON2L_SMPI3_POSN                                 0x5
#define _ADCON2L_SMPI3_POSITION                             0x5
#define _ADCON2L_SMPI3_SIZE                                 0x1
#define _ADCON2L_SMPI3_LENGTH                               0x1
#define _ADCON2L_SMPI3_MASK                                 0x20
#define _ADCON2L_SMPI4_POSN                                 0x6
#define _ADCON2L_SMPI4_POSITION                             0x6
#define _ADCON2L_SMPI4_SIZE                                 0x1
#define _ADCON2L_SMPI4_LENGTH                               0x1
#define _ADCON2L_SMPI4_MASK                                 0x40

// Register: ADCON2H
#define ADCON2H ADCON2H
extern volatile unsigned char           ADCON2H             __at(0xE8D);
#ifndef _LIB_BUILD
asm("ADCON2H equ 0E8Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned CSCNA                  :1;
        unsigned BUFREGEN               :1;
        unsigned OFFCAL                 :1;
        unsigned NVCFG0                 :1;
        unsigned PVCFG                  :2;
    };
    struct {
        unsigned                        :6;
        unsigned PVCFG0                 :1;
        unsigned PVCFG1                 :1;
    };
} ADCON2Hbits_t;
extern volatile ADCON2Hbits_t ADCON2Hbits __at(0xE8D);
// bitfield macros
#define _ADCON2H_CSCNA_POSN                                 0x2
#define _ADCON2H_CSCNA_POSITION                             0x2
#define _ADCON2H_CSCNA_SIZE                                 0x1
#define _ADCON2H_CSCNA_LENGTH                               0x1
#define _ADCON2H_CSCNA_MASK                                 0x4
#define _ADCON2H_BUFREGEN_POSN                              0x3
#define _ADCON2H_BUFREGEN_POSITION                          0x3
#define _ADCON2H_BUFREGEN_SIZE                              0x1
#define _ADCON2H_BUFREGEN_LENGTH                            0x1
#define _ADCON2H_BUFREGEN_MASK                              0x8
#define _ADCON2H_OFFCAL_POSN                                0x4
#define _ADCON2H_OFFCAL_POSITION                            0x4
#define _ADCON2H_OFFCAL_SIZE                                0x1
#define _ADCON2H_OFFCAL_LENGTH                              0x1
#define _ADCON2H_OFFCAL_MASK                                0x10
#define _ADCON2H_NVCFG0_POSN                                0x5
#define _ADCON2H_NVCFG0_POSITION                            0x5
#define _ADCON2H_NVCFG0_SIZE                                0x1
#define _ADCON2H_NVCFG0_LENGTH                              0x1
#define _ADCON2H_NVCFG0_MASK                                0x20
#define _ADCON2H_PVCFG_POSN                                 0x6
#define _ADCON2H_PVCFG_POSITION                             0x6
#define _ADCON2H_PVCFG_SIZE                                 0x2
#define _ADCON2H_PVCFG_LENGTH                               0x2
#define _ADCON2H_PVCFG_MASK                                 0xC0
#define _ADCON2H_PVCFG0_POSN                                0x6
#define _ADCON2H_PVCFG0_POSITION                            0x6
#define _ADCON2H_PVCFG0_SIZE                                0x1
#define _ADCON2H_PVCFG0_LENGTH                              0x1
#define _ADCON2H_PVCFG0_MASK                                0x40
#define _ADCON2H_PVCFG1_POSN                                0x7
#define _ADCON2H_PVCFG1_POSITION                            0x7
#define _ADCON2H_PVCFG1_SIZE                                0x1
#define _ADCON2H_PVCFG1_LENGTH                              0x1
#define _ADCON2H_PVCFG1_MASK                                0x80

// Register: LCDDATA0
#define LCDDATA0 LCDDATA0
extern volatile unsigned char           LCDDATA0            __at(0xE8E);
#ifndef _LIB_BUILD
asm("LCDDATA0 equ 0E8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C0                  :1;
        unsigned S01C0                  :1;
        unsigned S02C0                  :1;
        unsigned S03C0                  :1;
        unsigned S04C0                  :1;
        unsigned S05C0                  :1;
        unsigned S06C0                  :1;
        unsigned S07C0                  :1;
    };
} LCDDATA0bits_t;
extern volatile LCDDATA0bits_t LCDDATA0bits __at(0xE8E);
// bitfield macros
#define _LCDDATA0_S00C0_POSN                                0x0
#define _LCDDATA0_S00C0_POSITION                            0x0
#define _LCDDATA0_S00C0_SIZE                                0x1
#define _LCDDATA0_S00C0_LENGTH                              0x1
#define _LCDDATA0_S00C0_MASK                                0x1
#define _LCDDATA0_S01C0_POSN                                0x1
#define _LCDDATA0_S01C0_POSITION                            0x1
#define _LCDDATA0_S01C0_SIZE                                0x1
#define _LCDDATA0_S01C0_LENGTH                              0x1
#define _LCDDATA0_S01C0_MASK                                0x2
#define _LCDDATA0_S02C0_POSN                                0x2
#define _LCDDATA0_S02C0_POSITION                            0x2
#define _LCDDATA0_S02C0_SIZE                                0x1
#define _LCDDATA0_S02C0_LENGTH                              0x1
#define _LCDDATA0_S02C0_MASK                                0x4
#define _LCDDATA0_S03C0_POSN                                0x3
#define _LCDDATA0_S03C0_POSITION                            0x3
#define _LCDDATA0_S03C0_SIZE                                0x1
#define _LCDDATA0_S03C0_LENGTH                              0x1
#define _LCDDATA0_S03C0_MASK                                0x8
#define _LCDDATA0_S04C0_POSN                                0x4
#define _LCDDATA0_S04C0_POSITION                            0x4
#define _LCDDATA0_S04C0_SIZE                                0x1
#define _LCDDATA0_S04C0_LENGTH                              0x1
#define _LCDDATA0_S04C0_MASK                                0x10
#define _LCDDATA0_S05C0_POSN                                0x5
#define _LCDDATA0_S05C0_POSITION                            0x5
#define _LCDDATA0_S05C0_SIZE                                0x1
#define _LCDDATA0_S05C0_LENGTH                              0x1
#define _LCDDATA0_S05C0_MASK                                0x20
#define _LCDDATA0_S06C0_POSN                                0x6
#define _LCDDATA0_S06C0_POSITION                            0x6
#define _LCDDATA0_S06C0_SIZE                                0x1
#define _LCDDATA0_S06C0_LENGTH                              0x1
#define _LCDDATA0_S06C0_MASK                                0x40
#define _LCDDATA0_S07C0_POSN                                0x7
#define _LCDDATA0_S07C0_POSITION                            0x7
#define _LCDDATA0_S07C0_SIZE                                0x1
#define _LCDDATA0_S07C0_LENGTH                              0x1
#define _LCDDATA0_S07C0_MASK                                0x80

// Register: LCDDATA1
#define LCDDATA1 LCDDATA1
extern volatile unsigned char           LCDDATA1            __at(0xE8F);
#ifndef _LIB_BUILD
asm("LCDDATA1 equ 0E8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C0                  :1;
        unsigned S09C0                  :1;
        unsigned S10C0                  :1;
        unsigned S11C0                  :1;
        unsigned S12C0                  :1;
        unsigned S13C0                  :1;
        unsigned S14C0                  :1;
        unsigned S15C0                  :1;
    };
} LCDDATA1bits_t;
