MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J99/mcu.h
extern volatile TXBUFbits_t TXBUFbits __at(0xF6A);
// bitfield macros
#define _TXBUF_TXBUF_POSN                                   0x0
#define _TXBUF_TXBUF_POSITION                               0x0
#define _TXBUF_TXBUF_SIZE                                   0x8
#define _TXBUF_TXBUF_LENGTH                                 0x8
#define _TXBUF_TXBUF_MASK                                   0xFF
#define _TXBUF_TXBUF0_POSN                                  0x0
#define _TXBUF_TXBUF0_POSITION                              0x0
#define _TXBUF_TXBUF0_SIZE                                  0x1
#define _TXBUF_TXBUF0_LENGTH                                0x1
#define _TXBUF_TXBUF0_MASK                                  0x1
#define _TXBUF_TXBUF1_POSN                                  0x1
#define _TXBUF_TXBUF1_POSITION                              0x1
#define _TXBUF_TXBUF1_SIZE                                  0x1
#define _TXBUF_TXBUF1_LENGTH                                0x1
#define _TXBUF_TXBUF1_MASK                                  0x2
#define _TXBUF_TXBUF2_POSN                                  0x2
#define _TXBUF_TXBUF2_POSITION                              0x2
#define _TXBUF_TXBUF2_SIZE                                  0x1
#define _TXBUF_TXBUF2_LENGTH                                0x1
#define _TXBUF_TXBUF2_MASK                                  0x4
#define _TXBUF_TXBUF3_POSN                                  0x3
#define _TXBUF_TXBUF3_POSITION                              0x3
#define _TXBUF_TXBUF3_SIZE                                  0x1
#define _TXBUF_TXBUF3_LENGTH                                0x1
#define _TXBUF_TXBUF3_MASK                                  0x8
#define _TXBUF_TXBUF4_POSN                                  0x4
#define _TXBUF_TXBUF4_POSITION                              0x4
#define _TXBUF_TXBUF4_SIZE                                  0x1
#define _TXBUF_TXBUF4_LENGTH                                0x1
#define _TXBUF_TXBUF4_MASK                                  0x10
#define _TXBUF_TXBUF5_POSN                                  0x5
#define _TXBUF_TXBUF5_POSITION                              0x5
#define _TXBUF_TXBUF5_SIZE                                  0x1
#define _TXBUF_TXBUF5_LENGTH                                0x1
#define _TXBUF_TXBUF5_MASK                                  0x20
#define _TXBUF_TXBUF6_POSN                                  0x6
#define _TXBUF_TXBUF6_POSITION                              0x6
#define _TXBUF_TXBUF6_SIZE                                  0x1
#define _TXBUF_TXBUF6_LENGTH                                0x1
#define _TXBUF_TXBUF6_MASK                                  0x40
#define _TXBUF_TXBUF7_POSN                                  0x7
#define _TXBUF_TXBUF7_POSITION                              0x7
#define _TXBUF_TXBUF7_SIZE                                  0x1
#define _TXBUF_TXBUF7_LENGTH                                0x1
#define _TXBUF_TXBUF7_MASK                                  0x80

// Register: DMABCH
#define DMABCH DMABCH
extern volatile unsigned char           DMABCH              __at(0xF6B);
#ifndef _LIB_BUILD
asm("DMABCH equ 0F6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMACNTHB               :2;
    };
    struct {
        unsigned BC8                    :1;
        unsigned BC9                    :1;
    };
} DMABCHbits_t;
extern volatile DMABCHbits_t DMABCHbits __at(0xF6B);
// bitfield macros
#define _DMABCH_DMACNTHB_POSN                               0x0
#define _DMABCH_DMACNTHB_POSITION                           0x0
#define _DMABCH_DMACNTHB_SIZE                               0x2
#define _DMABCH_DMACNTHB_LENGTH                             0x2
#define _DMABCH_DMACNTHB_MASK                               0x3
#define _DMABCH_BC8_POSN                                    0x0
#define _DMABCH_BC8_POSITION                                0x0
#define _DMABCH_BC8_SIZE                                    0x1
#define _DMABCH_BC8_LENGTH                                  0x1
#define _DMABCH_BC8_MASK                                    0x1
#define _DMABCH_BC9_POSN                                    0x1
#define _DMABCH_BC9_POSITION                                0x1
#define _DMABCH_BC9_SIZE                                    0x1
#define _DMABCH_BC9_LENGTH                                  0x1
#define _DMABCH_BC9_MASK                                    0x2

// Register: DMABCL
#define DMABCL DMABCL
extern volatile unsigned char           DMABCL              __at(0xF6C);
#ifndef _LIB_BUILD
asm("DMABCL equ 0F6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMACNTLB               :8;
    };
    struct {
        unsigned BC0                    :1;
        unsigned BC1                    :1;
        unsigned BC2                    :1;
        unsigned BC3                    :1;
        unsigned BC4                    :1;
        unsigned BC5                    :1;
        unsigned BC6                    :1;
        unsigned BC7                    :1;
    };
} DMABCLbits_t;
extern volatile DMABCLbits_t DMABCLbits __at(0xF6C);
// bitfield macros
#define _DMABCL_DMACNTLB_POSN                               0x0
#define _DMABCL_DMACNTLB_POSITION                           0x0
#define _DMABCL_DMACNTLB_SIZE                               0x8
#define _DMABCL_DMACNTLB_LENGTH                             0x8
#define _DMABCL_DMACNTLB_MASK                               0xFF
#define _DMABCL_BC0_POSN                                    0x0
#define _DMABCL_BC0_POSITION                                0x0
#define _DMABCL_BC0_SIZE                                    0x1
#define _DMABCL_BC0_LENGTH                                  0x1
#define _DMABCL_BC0_MASK                                    0x1
#define _DMABCL_BC1_POSN                                    0x1
#define _DMABCL_BC1_POSITION                                0x1
#define _DMABCL_BC1_SIZE                                    0x1
#define _DMABCL_BC1_LENGTH                                  0x1
#define _DMABCL_BC1_MASK                                    0x2
#define _DMABCL_BC2_POSN                                    0x2
#define _DMABCL_BC2_POSITION                                0x2
#define _DMABCL_BC2_SIZE                                    0x1
#define _DMABCL_BC2_LENGTH                                  0x1
#define _DMABCL_BC2_MASK                                    0x4
#define _DMABCL_BC3_POSN                                    0x3
#define _DMABCL_BC3_POSITION                                0x3
#define _DMABCL_BC3_SIZE                                    0x1
#define _DMABCL_BC3_LENGTH                                  0x1
#define _DMABCL_BC3_MASK                                    0x8
#define _DMABCL_BC4_POSN                                    0x4
#define _DMABCL_BC4_POSITION                                0x4
#define _DMABCL_BC4_SIZE                                    0x1
#define _DMABCL_BC4_LENGTH                                  0x1
#define _DMABCL_BC4_MASK                                    0x10
#define _DMABCL_BC5_POSN                                    0x5
#define _DMABCL_BC5_POSITION                                0x5
#define _DMABCL_BC5_SIZE                                    0x1
#define _DMABCL_BC5_LENGTH                                  0x1
#define _DMABCL_BC5_MASK                                    0x20
#define _DMABCL_BC6_POSN                                    0x6
#define _DMABCL_BC6_POSITION                                0x6
#define _DMABCL_BC6_SIZE                                    0x1
#define _DMABCL_BC6_LENGTH                                  0x1
#define _DMABCL_BC6_MASK                                    0x40
#define _DMABCL_BC7_POSN                                    0x7
#define _DMABCL_BC7_POSITION                                0x7
#define _DMABCL_BC7_SIZE                                    0x1
#define _DMABCL_BC7_LENGTH                                  0x1
#define _DMABCL_BC7_MASK                                    0x80

// Register: RXADDRH
#define RXADDRH RXADDRH
extern volatile unsigned char           RXADDRH             __at(0xF6D);
#ifndef _LIB_BUILD
asm("RXADDRH equ 0F6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMARCVPTRHB            :4;
    };
    struct {
        unsigned RXADDR8                :1;
        unsigned RXADDR9                :1;
        unsigned RXADDR10               :1;
        unsigned RXADDR11               :1;
    };
} RXADDRHbits_t;
