MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J99/mcu.h
// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0xFFD);
#ifndef _LIB_BUILD
asm("TOSL equ 0FFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSL                   :8;
    };
} TOSLbits_t;
extern volatile TOSLbits_t TOSLbits __at(0xFFD);
// bitfield macros
#define _TOSL_TOSL_POSN                                     0x0
#define _TOSL_TOSL_POSITION                                 0x0
#define _TOSL_TOSL_SIZE                                     0x8
#define _TOSL_TOSL_LENGTH                                   0x8
#define _TOSL_TOSL_MASK                                     0xFF

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0xFFE);
#ifndef _LIB_BUILD
asm("TOSH equ 0FFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSH                   :8;
    };
} TOSHbits_t;
extern volatile TOSHbits_t TOSHbits __at(0xFFE);
// bitfield macros
#define _TOSH_TOSH_POSN                                     0x0
#define _TOSH_TOSH_POSITION                                 0x0
#define _TOSH_TOSH_SIZE                                     0x8
#define _TOSH_TOSH_LENGTH                                   0x8
#define _TOSH_TOSH_MASK                                     0xFF

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0xFFF);
#ifndef _LIB_BUILD
asm("TOSU equ 0FFFh");
#endif

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// BAUDCON1<ABDEN1>
extern volatile __bit                   ABDEN1              __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 ABDEN1_bit          _BIT_ACCESS(BAUDCON1,0)
// BAUDCON2<ABDEN2>
extern volatile __bit                   ABDEN2              __at(0x7988);	// @ (0xF31 * 8 + 0)
#define                                 ABDEN2_bit          _BIT_ACCESS(BAUDCON2,0)
// BAUDCON3<ABDEN3>
extern volatile __bit                   ABDEN3              __at(0x7968);	// @ (0xF2D * 8 + 0)
#define                                 ABDEN3_bit          _BIT_ACCESS(BAUDCON3,0)
// BAUDCON4<ABDEN4>
extern volatile __bit                   ABDEN4              __at(0x77E8);	// @ (0xEFD * 8 + 0)
#define                                 ABDEN4_bit          _BIT_ACCESS(BAUDCON4,0)
// BAUDCON1<ABDOVF1>
extern volatile __bit                   ABDOVF1             __at(0x7B3F);	// @ (0xF67 * 8 + 7)
#define                                 ABDOVF1_bit         _BIT_ACCESS(BAUDCON1,7)
// BAUDCON2<ABDOVF2>
extern volatile __bit                   ABDOVF2             __at(0x798F);	// @ (0xF31 * 8 + 7)
#define                                 ABDOVF2_bit         _BIT_ACCESS(BAUDCON2,7)
// BAUDCON3<ABDOVF3>
extern volatile __bit                   ABDOVF3             __at(0x796F);	// @ (0xF2D * 8 + 7)
#define                                 ABDOVF3_bit         _BIT_ACCESS(BAUDCON3,7)
// BAUDCON4<ABDOVF4>
extern volatile __bit                   ABDOVF4             __at(0x77EF);	// @ (0xEFD * 8 + 7)
#define                                 ABDOVF4_bit         _BIT_ACCESS(BAUDCON4,7)
// SSP1CON2<ACKDT1>
extern volatile __bit                   ACKDT1              __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ACKDT1_bit          _BIT_ACCESS(SSP1CON2,5)
// SSP2CON2<ACKDT2>
extern volatile __bit                   ACKDT2              __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 ACKDT2_bit          _BIT_ACCESS(SSP2CON2,5)
// SSP1CON2<ACKEN1>
extern volatile __bit                   ACKEN1              __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ACKEN1_bit          _BIT_ACCESS(SSP1CON2,4)
// SSP2CON2<ACKEN2>
extern volatile __bit                   ACKEN2              __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 ACKEN2_bit          _BIT_ACCESS(SSP2CON2,4)
// SSP1CON2<ACKSTAT1>
extern volatile __bit                   ACKSTAT1            __at(0x7E2E);	// @ (0xFC5 * 8 + 6)
#define                                 ACKSTAT1_bit        _BIT_ACCESS(SSP1CON2,6)
// SSP2CON2<ACKSTAT2>
extern volatile __bit                   ACKSTAT2            __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 ACKSTAT2_bit        _BIT_ACCESS(SSP2CON2,6)
// ACTCON<ACTEN>
extern volatile __bit                   ACTEN               __at(0x7B1F);	// @ (0xF63 * 8 + 7)
#define                                 ACTEN_bit           _BIT_ACCESS(ACTCON,7)
// ACTCON<ACTLOCK>
extern volatile __bit                   ACTLOCK             __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 ACTLOCK_bit         _BIT_ACCESS(ACTCON,3)
// PIE5<ACTLOCKIE>
extern volatile __bit                   ACTLOCKIE           __at(0x7DBD);	// @ (0xFB7 * 8 + 5)
#define                                 ACTLOCKIE_bit       _BIT_ACCESS(PIE5,5)
// PIR5<ACTLOCKIF>
extern volatile __bit                   ACTLOCKIF           __at(0x7DC5);	// @ (0xFB8 * 8 + 5)
#define                                 ACTLOCKIF_bit       _BIT_ACCESS(PIR5,5)
// IPR5<ACTLOCKIP>
extern volatile __bit                   ACTLOCKIP           __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 ACTLOCKIP_bit       _BIT_ACCESS(IPR5,5)
// ACTCON<ACTLOCKPOL>
extern volatile __bit                   ACTLOCKPOL          __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 ACTLOCKPOL_bit      _BIT_ACCESS(ACTCON,2)
// ACTCON<ACTORS>
extern volatile __bit                   ACTORS              __at(0x7B19);	// @ (0xF63 * 8 + 1)
#define                                 ACTORS_bit          _BIT_ACCESS(ACTCON,1)
// PIE5<ACTORSIE>
extern volatile __bit                   ACTORSIE            __at(0x7DBE);	// @ (0xFB7 * 8 + 6)
#define                                 ACTORSIE_bit        _BIT_ACCESS(PIE5,6)
// PIR5<ACTORSIF>
extern volatile __bit                   ACTORSIF            __at(0x7DC6);	// @ (0xFB8 * 8 + 6)
#define                                 ACTORSIF_bit        _BIT_ACCESS(PIR5,6)
// IPR5<ACTORSIP>
extern volatile __bit                   ACTORSIP            __at(0x7E96);	// @ (0xFD2 * 8 + 6)
#define                                 ACTORSIP_bit        _BIT_ACCESS(IPR5,6)
// ACTCON<ACTORSPOL>
extern volatile __bit                   ACTORSPOL           __at(0x7B18);	// @ (0xF63 * 8 + 0)
#define                                 ACTORSPOL_bit       _BIT_ACCESS(ACTCON,0)
// ACTCON<ACTSIDL>
extern volatile __bit                   ACTSIDL             __at(0x7B1D);	// @ (0xF63 * 8 + 5)
#define                                 ACTSIDL_bit         _BIT_ACCESS(ACTCON,5)
// ACTCON<ACTSRC>
extern volatile __bit                   ACTSRC              __at(0x7B1C);	// @ (0xF63 * 8 + 4)
#define                                 ACTSRC_bit          _BIT_ACCESS(ACTCON,4)
// UIE<ACTVIE>
extern volatile __bit                   ACTVIE              __at(0x7082);	// @ (0xE10 * 8 + 2)
#define                                 ACTVIE_bit          _BIT_ACCESS(UIE,2)
// UIR<ACTVIF>
extern volatile __bit                   ACTVIF              __at(0x7BC2);	// @ (0xF78 * 8 + 2)
#define                                 ACTVIF_bit          _BIT_ACCESS(UIR,2)
// PMD3<ADCMD>
extern volatile __bit                   ADCMD               __at(0x778D);	// @ (0xEF1 * 8 + 5)
#define                                 ADCMD_bit           _BIT_ACCESS(PMD3,5)
// ADCON3L<ADCS0>
extern volatile __bit                   ADCS0               __at(0x7450);	// @ (0xE8A * 8 + 0)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON3L,0)
// ADCON3L<ADCS1>
extern volatile __bit                   ADCS1               __at(0x7451);	// @ (0xE8A * 8 + 1)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON3L,1)
// ADCON3L<ADCS2>
extern volatile __bit                   ADCS2               __at(0x7452);	// @ (0xE8A * 8 + 2)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON3L,2)
// ADCON3L<ADCS3>
extern volatile __bit                   ADCS3               __at(0x7453);	// @ (0xE8A * 8 + 3)
#define                                 ADCS3_bit           _BIT_ACCESS(ADCON3L,3)
// ADCON3L<ADCS4>
extern volatile __bit                   ADCS4               __at(0x7454);	// @ (0xE8A * 8 + 4)
#define                                 ADCS4_bit           _BIT_ACCESS(ADCON3L,4)
// ADCON3L<ADCS5>
extern volatile __bit                   ADCS5               __at(0x7455);	// @ (0xE8A * 8 + 5)
#define                                 ADCS5_bit           _BIT_ACCESS(ADCON3L,5)
// ADCON3L<ADCS6>
extern volatile __bit                   ADCS6               __at(0x7456);	// @ (0xE8A * 8 + 6)
#define                                 ADCS6_bit           _BIT_ACCESS(ADCON3L,6)
// ADCON3L<ADCS7>
extern volatile __bit                   ADCS7               __at(0x7457);	// @ (0xE8A * 8 + 7)
#define                                 ADCS7_bit           _BIT_ACCESS(ADCON3L,7)
// UADDR<ADDR0>
extern volatile __bit                   ADDR0               __at(0x7BA0);	// @ (0xF74 * 8 + 0)
#define                                 ADDR0_bit           _BIT_ACCESS(UADDR,0)
// UADDR<ADDR1>
extern volatile __bit                   ADDR1               __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 ADDR1_bit           _BIT_ACCESS(UADDR,1)
// UADDR<ADDR2>
extern volatile __bit                   ADDR2               __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 ADDR2_bit           _BIT_ACCESS(UADDR,2)
// UADDR<ADDR3>
extern volatile __bit                   ADDR3               __at(0x7BA3);	// @ (0xF74 * 8 + 3)
#define                                 ADDR3_bit           _BIT_ACCESS(UADDR,3)
// UADDR<ADDR4>
extern volatile __bit                   ADDR4               __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 ADDR4_bit           _BIT_ACCESS(UADDR,4)
// UADDR<ADDR5>
extern volatile __bit                   ADDR5               __at(0x7BA5);	// @ (0xF74 * 8 + 5)
#define                                 ADDR5_bit           _BIT_ACCESS(UADDR,5)
// UADDR<ADDR6>
extern volatile __bit                   ADDR6               __at(0x7BA6);	// @ (0xF74 * 8 + 6)
#define                                 ADDR6_bit           _BIT_ACCESS(UADDR,6)
// RCSTA1<ADEN>
extern volatile __bit                   ADEN                __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADEN_bit            _BIT_ACCESS(RCSTA1,3)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// IPR1<ADIP>
extern volatile __bit                   ADIP                __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 ADIP_bit            _BIT_ACCESS(IPR1,6)
// SSP1CON2<ADMSK11>
extern volatile __bit                   ADMSK11             __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 ADMSK11_bit         _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<ADMSK12>
extern volatile __bit                   ADMSK12             __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 ADMSK12_bit         _BIT_ACCESS(SSP2CON2,1)
// SSP1CON2<ADMSK21>
extern volatile __bit                   ADMSK21             __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 ADMSK21_bit         _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<ADMSK22>
extern volatile __bit                   ADMSK22             __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 ADMSK22_bit         _BIT_ACCESS(SSP2CON2,2)
// SSP1CON2<ADMSK31>
extern volatile __bit                   ADMSK31             __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 ADMSK31_bit         _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<ADMSK32>
extern volatile __bit                   ADMSK32             __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 ADMSK32_bit         _BIT_ACCESS(SSP2CON2,3)
// SSP1CON2<ADMSK41>
extern volatile __bit                   ADMSK41             __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ADMSK41_bit         _BIT_ACCESS(SSP1CON2,4)
// SSP2CON2<ADMSK42>
extern volatile __bit                   ADMSK42             __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 ADMSK42_bit         _BIT_ACCESS(SSP2CON2,4)
// SSP1CON2<ADMSK51>
extern volatile __bit                   ADMSK51             __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ADMSK51_bit         _BIT_ACCESS(SSP1CON2,5)
// SSP2CON2<ADMSK52>
extern volatile __bit                   ADMSK52             __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 ADMSK52_bit         _BIT_ACCESS(SSP2CON2,5)
// ADCON1H<ADON>
extern volatile __bit                   ADON                __at(0x7E0F);	// @ (0xFC1 * 8 + 7)
#define                                 ADON_bit            _BIT_ACCESS(ADCON1H,7)
// ADCON3H<ADRC>
extern volatile __bit                   ADRC                __at(0x745F);	// @ (0xE8B * 8 + 7)
#define                                 ADRC_bit            _BIT_ACCESS(ADCON3H,7)
// ALRMCFG<ALRMEN>
extern volatile __bit                   ALRMEN              __at(0x7ADF);	// @ (0xF5B * 8 + 7)
#define                                 ALRMEN_bit          _BIT_ACCESS(ALRMCFG,7)
// ALRMCFG<ALRMPTR0>
extern volatile __bit                   ALRMPTR0            __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 ALRMPTR0_bit        _BIT_ACCESS(ALRMCFG,0)
// ALRMCFG<ALRMPTR1>
extern volatile __bit                   ALRMPTR1            __at(0x7AD9);	// @ (0xF5B * 8 + 1)
#define                                 ALRMPTR1_bit        _BIT_ACCESS(ALRMCFG,1)
// ADCON2L<ALTS>
extern volatile __bit                   ALTS                __at(0x7460);	// @ (0xE8C * 8 + 0)
#define                                 ALTS_bit            _BIT_ACCESS(ADCON2L,0)
// ALRMCFG<AMASK0>
extern volatile __bit                   AMASK0              __at(0x7ADA);	// @ (0xF5B * 8 + 2)
#define                                 AMASK0_bit          _BIT_ACCESS(ALRMCFG,2)
// ALRMCFG<AMASK1>
extern volatile __bit                   AMASK1              __at(0x7ADB);	// @ (0xF5B * 8 + 3)
#define                                 AMASK1_bit          _BIT_ACCESS(ALRMCFG,3)
// ALRMCFG<AMASK2>
extern volatile __bit                   AMASK2              __at(0x7ADC);	// @ (0xF5B * 8 + 4)
#define                                 AMASK2_bit          _BIT_ACCESS(ALRMCFG,4)
// ALRMCFG<AMASK3>
extern volatile __bit                   AMASK3              __at(0x7ADD);	// @ (0xF5B * 8 + 5)
#define                                 AMASK3_bit          _BIT_ACCESS(ALRMCFG,5)
// ANCON1<ANSEL0>
extern volatile __bit                   ANSEL0              __at(0x7238);	// @ (0xE47 * 8 + 0)
#define                                 ANSEL0_bit          _BIT_ACCESS(ANCON1,0)
// ANCON1<ANSEL1>
extern volatile __bit                   ANSEL1              __at(0x7239);	// @ (0xE47 * 8 + 1)
#define                                 ANSEL1_bit          _BIT_ACCESS(ANCON1,1)
// ANCON2<ANSEL10>
extern volatile __bit                   ANSEL10             __at(0x7232);	// @ (0xE46 * 8 + 2)
#define                                 ANSEL10_bit         _BIT_ACCESS(ANCON2,2)
// ANCON2<ANSEL11>
extern volatile __bit                   ANSEL11             __at(0x7233);	// @ (0xE46 * 8 + 3)
#define                                 ANSEL11_bit         _BIT_ACCESS(ANCON2,3)
// ANCON2<ANSEL12>
extern volatile __bit                   ANSEL12             __at(0x7234);	// @ (0xE46 * 8 + 4)
#define                                 ANSEL12_bit         _BIT_ACCESS(ANCON2,4)
// ANCON2<ANSEL13>
extern volatile __bit                   ANSEL13             __at(0x7235);	// @ (0xE46 * 8 + 5)
#define                                 ANSEL13_bit         _BIT_ACCESS(ANCON2,5)
// ANCON2<ANSEL14>
extern volatile __bit                   ANSEL14             __at(0x7236);	// @ (0xE46 * 8 + 6)
#define                                 ANSEL14_bit         _BIT_ACCESS(ANCON2,6)
// ANCON2<ANSEL15>
extern volatile __bit                   ANSEL15             __at(0x7237);	// @ (0xE46 * 8 + 7)
#define                                 ANSEL15_bit         _BIT_ACCESS(ANCON2,7)
// ANCON3<ANSEL16>
extern volatile __bit                   ANSEL16             __at(0x7228);	// @ (0xE45 * 8 + 0)
#define                                 ANSEL16_bit         _BIT_ACCESS(ANCON3,0)
// ANCON3<ANSEL17>
extern volatile __bit                   ANSEL17             __at(0x7229);	// @ (0xE45 * 8 + 1)
#define                                 ANSEL17_bit         _BIT_ACCESS(ANCON3,1)
// ANCON3<ANSEL18>
extern volatile __bit                   ANSEL18             __at(0x722A);	// @ (0xE45 * 8 + 2)
#define                                 ANSEL18_bit         _BIT_ACCESS(ANCON3,2)
// ANCON3<ANSEL19>
extern volatile __bit                   ANSEL19             __at(0x722B);	// @ (0xE45 * 8 + 3)
#define                                 ANSEL19_bit         _BIT_ACCESS(ANCON3,3)
// ANCON1<ANSEL2>
extern volatile __bit                   ANSEL2              __at(0x723A);	// @ (0xE47 * 8 + 2)
#define                                 ANSEL2_bit          _BIT_ACCESS(ANCON1,2)
// ANCON3<ANSEL20>
extern volatile __bit                   ANSEL20             __at(0x722C);	// @ (0xE45 * 8 + 4)
#define                                 ANSEL20_bit         _BIT_ACCESS(ANCON3,4)
// ANCON3<ANSEL21>
extern volatile __bit                   ANSEL21             __at(0x722D);	// @ (0xE45 * 8 + 5)
#define                                 ANSEL21_bit         _BIT_ACCESS(ANCON3,5)
// ANCON3<ANSEL22>
extern volatile __bit                   ANSEL22             __at(0x722E);	// @ (0xE45 * 8 + 6)
#define                                 ANSEL22_bit         _BIT_ACCESS(ANCON3,6)
// ANCON3<ANSEL23>
extern volatile __bit                   ANSEL23             __at(0x722F);	// @ (0xE45 * 8 + 7)
#define                                 ANSEL23_bit         _BIT_ACCESS(ANCON3,7)
// ANCON1<ANSEL3>
extern volatile __bit                   ANSEL3              __at(0x723B);	// @ (0xE47 * 8 + 3)
#define                                 ANSEL3_bit          _BIT_ACCESS(ANCON1,3)
// ANCON1<ANSEL4>
extern volatile __bit                   ANSEL4              __at(0x723C);	// @ (0xE47 * 8 + 4)
#define                                 ANSEL4_bit          _BIT_ACCESS(ANCON1,4)
// ANCON1<ANSEL5>
extern volatile __bit                   ANSEL5              __at(0x723D);	// @ (0xE47 * 8 + 5)
#define                                 ANSEL5_bit          _BIT_ACCESS(ANCON1,5)
// ANCON1<ANSEL6>
extern volatile __bit                   ANSEL6              __at(0x723E);	// @ (0xE47 * 8 + 6)
#define                                 ANSEL6_bit          _BIT_ACCESS(ANCON1,6)
// ANCON1<ANSEL7>
extern volatile __bit                   ANSEL7              __at(0x723F);	// @ (0xE47 * 8 + 7)
#define                                 ANSEL7_bit          _BIT_ACCESS(ANCON1,7)
// ANCON2<ANSEL8>
extern volatile __bit                   ANSEL8              __at(0x7230);	// @ (0xE46 * 8 + 0)
#define                                 ANSEL8_bit          _BIT_ACCESS(ANCON2,0)
// ANCON2<ANSEL9>
extern volatile __bit                   ANSEL9              __at(0x7231);	// @ (0xE46 * 8 + 1)
#define                                 ANSEL9_bit          _BIT_ACCESS(ANCON2,1)
// ALRMRPT<ARPT0>
extern volatile __bit                   ARPT0               __at(0x7AD0);	// @ (0xF5A * 8 + 0)
#define                                 ARPT0_bit           _BIT_ACCESS(ALRMRPT,0)
// ALRMRPT<ARPT1>
extern volatile __bit                   ARPT1               __at(0x7AD1);	// @ (0xF5A * 8 + 1)
#define                                 ARPT1_bit           _BIT_ACCESS(ALRMRPT,1)
// ALRMRPT<ARPT2>
extern volatile __bit                   ARPT2               __at(0x7AD2);	// @ (0xF5A * 8 + 2)
#define                                 ARPT2_bit           _BIT_ACCESS(ALRMRPT,2)
// ALRMRPT<ARPT3>
extern volatile __bit                   ARPT3               __at(0x7AD3);	// @ (0xF5A * 8 + 3)
#define                                 ARPT3_bit           _BIT_ACCESS(ALRMRPT,3)
// ALRMRPT<ARPT4>
extern volatile __bit                   ARPT4               __at(0x7AD4);	// @ (0xF5A * 8 + 4)
#define                                 ARPT4_bit           _BIT_ACCESS(ALRMRPT,4)
// ALRMRPT<ARPT5>
extern volatile __bit                   ARPT5               __at(0x7AD5);	// @ (0xF5A * 8 + 5)
#define                                 ARPT5_bit           _BIT_ACCESS(ALRMRPT,5)
// ALRMRPT<ARPT6>
extern volatile __bit                   ARPT6               __at(0x7AD6);	// @ (0xF5A * 8 + 6)
#define                                 ARPT6_bit           _BIT_ACCESS(ALRMRPT,6)
// ALRMRPT<ARPT7>
extern volatile __bit                   ARPT7               __at(0x7AD7);	// @ (0xF5A * 8 + 7)
#define                                 ARPT7_bit           _BIT_ACCESS(ALRMRPT,7)
// ADCON1L<ASAM>
extern volatile __bit                   ASAM                __at(0x7E02);	// @ (0xFC0 * 8 + 2)
#define                                 ASAM_bit            _BIT_ACCESS(ADCON1L,2)
// ADCON5H<ASENA>
extern volatile __bit                   ASENA               __at(0x744F);	// @ (0xE89 * 8 + 7)
#define                                 ASENA_bit           _BIT_ACCESS(ADCON5H,7)
// ADCON5H<ASINTMD0>
extern volatile __bit                   ASINTMD0            __at(0x7448);	// @ (0xE89 * 8 + 0)
#define                                 ASINTMD0_bit        _BIT_ACCESS(ADCON5H,0)
// ADCON5H<ASINTMD1>
extern volatile __bit                   ASINTMD1            __at(0x7449);	// @ (0xE89 * 8 + 1)
#define                                 ASINTMD1_bit        _BIT_ACCESS(ADCON5H,1)
// DMABCL<BC0>
extern volatile __bit                   BC0                 __at(0x7B60);	// @ (0xF6C * 8 + 0)
#define                                 BC0_bit             _BIT_ACCESS(DMABCL,0)
// DMABCL<BC1>
extern volatile __bit                   BC1                 __at(0x7B61);	// @ (0xF6C * 8 + 1)
#define                                 BC1_bit             _BIT_ACCESS(DMABCL,1)
// DMABCL<BC2>
extern volatile __bit                   BC2                 __at(0x7B62);	// @ (0xF6C * 8 + 2)
#define                                 BC2_bit             _BIT_ACCESS(DMABCL,2)
// DMABCL<BC3>
extern volatile __bit                   BC3                 __at(0x7B63);	// @ (0xF6C * 8 + 3)
#define                                 BC3_bit             _BIT_ACCESS(DMABCL,3)
// DMABCL<BC4>
extern volatile __bit                   BC4                 __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 BC4_bit             _BIT_ACCESS(DMABCL,4)
// DMABCL<BC5>
extern volatile __bit                   BC5                 __at(0x7B65);	// @ (0xF6C * 8 + 5)
#define                                 BC5_bit             _BIT_ACCESS(DMABCL,5)
// DMABCL<BC6>
extern volatile __bit                   BC6                 __at(0x7B66);	// @ (0xF6C * 8 + 6)
#define                                 BC6_bit             _BIT_ACCESS(DMABCL,6)
// DMABCL<BC7>
extern volatile __bit                   BC7                 __at(0x7B67);	// @ (0xF6C * 8 + 7)
#define                                 BC7_bit             _BIT_ACCESS(DMABCL,7)
// DMABCH<BC8>
extern volatile __bit                   BC8                 __at(0x7B58);	// @ (0xF6B * 8 + 0)
