MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J99/mcu.h
extern volatile __bit                   RPO36R1             __at(0x7121);	// @ (0xE24 * 8 + 1)
#define                                 RPO36R1_bit         _BIT_ACCESS(RPOR36_37,1)
// RPOR36_37<RPO36R2>
extern volatile __bit                   RPO36R2             __at(0x7122);	// @ (0xE24 * 8 + 2)
#define                                 RPO36R2_bit         _BIT_ACCESS(RPOR36_37,2)
// RPOR36_37<RPO36R3>
extern volatile __bit                   RPO36R3             __at(0x7123);	// @ (0xE24 * 8 + 3)
#define                                 RPO36R3_bit         _BIT_ACCESS(RPOR36_37,3)
// RPOR36_37<RPO37R0>
extern volatile __bit                   RPO37R0             __at(0x7124);	// @ (0xE24 * 8 + 4)
#define                                 RPO37R0_bit         _BIT_ACCESS(RPOR36_37,4)
// RPOR36_37<RPO37R1>
extern volatile __bit                   RPO37R1             __at(0x7125);	// @ (0xE24 * 8 + 5)
#define                                 RPO37R1_bit         _BIT_ACCESS(RPOR36_37,5)
// RPOR36_37<RPO37R2>
extern volatile __bit                   RPO37R2             __at(0x7126);	// @ (0xE24 * 8 + 6)
#define                                 RPO37R2_bit         _BIT_ACCESS(RPOR36_37,6)
// RPOR36_37<RPO37R3>
extern volatile __bit                   RPO37R3             __at(0x7127);	// @ (0xE24 * 8 + 7)
#define                                 RPO37R3_bit         _BIT_ACCESS(RPOR36_37,7)
// RPOR38_39<RPO38R0>
extern volatile __bit                   RPO38R0             __at(0x7128);	// @ (0xE25 * 8 + 0)
#define                                 RPO38R0_bit         _BIT_ACCESS(RPOR38_39,0)
// RPOR38_39<RPO38R1>
extern volatile __bit                   RPO38R1             __at(0x7129);	// @ (0xE25 * 8 + 1)
#define                                 RPO38R1_bit         _BIT_ACCESS(RPOR38_39,1)
// RPOR38_39<RPO38R2>
extern volatile __bit                   RPO38R2             __at(0x712A);	// @ (0xE25 * 8 + 2)
#define                                 RPO38R2_bit         _BIT_ACCESS(RPOR38_39,2)
// RPOR38_39<RPO38R3>
extern volatile __bit                   RPO38R3             __at(0x712B);	// @ (0xE25 * 8 + 3)
#define                                 RPO38R3_bit         _BIT_ACCESS(RPOR38_39,3)
// RPOR38_39<RPO39R0>
extern volatile __bit                   RPO39R0             __at(0x712C);	// @ (0xE25 * 8 + 4)
#define                                 RPO39R0_bit         _BIT_ACCESS(RPOR38_39,4)
// RPOR38_39<RPO39R1>
extern volatile __bit                   RPO39R1             __at(0x712D);	// @ (0xE25 * 8 + 5)
#define                                 RPO39R1_bit         _BIT_ACCESS(RPOR38_39,5)
// RPOR38_39<RPO39R2>
extern volatile __bit                   RPO39R2             __at(0x712E);	// @ (0xE25 * 8 + 6)
#define                                 RPO39R2_bit         _BIT_ACCESS(RPOR38_39,6)
// RPOR38_39<RPO39R3>
extern volatile __bit                   RPO39R3             __at(0x712F);	// @ (0xE25 * 8 + 7)
#define                                 RPO39R3_bit         _BIT_ACCESS(RPOR38_39,7)
// RPOR2_3<RPO3R0>
extern volatile __bit                   RPO3R0              __at(0x709C);	// @ (0xE13 * 8 + 4)
#define                                 RPO3R0_bit          _BIT_ACCESS(RPOR2_3,4)
// RPOR2_3<RPO3R1>
extern volatile __bit                   RPO3R1              __at(0x709D);	// @ (0xE13 * 8 + 5)
#define                                 RPO3R1_bit          _BIT_ACCESS(RPOR2_3,5)
// RPOR2_3<RPO3R2>
extern volatile __bit                   RPO3R2              __at(0x709E);	// @ (0xE13 * 8 + 6)
#define                                 RPO3R2_bit          _BIT_ACCESS(RPOR2_3,6)
// RPOR2_3<RPO3R3>
extern volatile __bit                   RPO3R3              __at(0x709F);	// @ (0xE13 * 8 + 7)
#define                                 RPO3R3_bit          _BIT_ACCESS(RPOR2_3,7)
// RPOR40_41<RPO40R0>
extern volatile __bit                   RPO40R0             __at(0x7130);	// @ (0xE26 * 8 + 0)
#define                                 RPO40R0_bit         _BIT_ACCESS(RPOR40_41,0)
// RPOR40_41<RPO40R1>
extern volatile __bit                   RPO40R1             __at(0x7131);	// @ (0xE26 * 8 + 1)
#define                                 RPO40R1_bit         _BIT_ACCESS(RPOR40_41,1)
// RPOR40_41<RPO40R2>
extern volatile __bit                   RPO40R2             __at(0x7132);	// @ (0xE26 * 8 + 2)
#define                                 RPO40R2_bit         _BIT_ACCESS(RPOR40_41,2)
// RPOR40_41<RPO40R3>
extern volatile __bit                   RPO40R3             __at(0x7133);	// @ (0xE26 * 8 + 3)
#define                                 RPO40R3_bit         _BIT_ACCESS(RPOR40_41,3)
// RPOR40_41<RPO41R0>
extern volatile __bit                   RPO41R0             __at(0x7134);	// @ (0xE26 * 8 + 4)
#define                                 RPO41R0_bit         _BIT_ACCESS(RPOR40_41,4)
// RPOR40_41<RPO41R1>
extern volatile __bit                   RPO41R1             __at(0x7135);	// @ (0xE26 * 8 + 5)
#define                                 RPO41R1_bit         _BIT_ACCESS(RPOR40_41,5)
// RPOR40_41<RPO41R2>
extern volatile __bit                   RPO41R2             __at(0x7136);	// @ (0xE26 * 8 + 6)
#define                                 RPO41R2_bit         _BIT_ACCESS(RPOR40_41,6)
// RPOR40_41<RPO41R3>
extern volatile __bit                   RPO41R3             __at(0x7137);	// @ (0xE26 * 8 + 7)
#define                                 RPO41R3_bit         _BIT_ACCESS(RPOR40_41,7)
// RPOR42_43<RPO42R0>
extern volatile __bit                   RPO42R0             __at(0x7138);	// @ (0xE27 * 8 + 0)
#define                                 RPO42R0_bit         _BIT_ACCESS(RPOR42_43,0)
// RPOR42_43<RPO42R1>
extern volatile __bit                   RPO42R1             __at(0x7139);	// @ (0xE27 * 8 + 1)
#define                                 RPO42R1_bit         _BIT_ACCESS(RPOR42_43,1)
// RPOR42_43<RPO42R2>
extern volatile __bit                   RPO42R2             __at(0x713A);	// @ (0xE27 * 8 + 2)
#define                                 RPO42R2_bit         _BIT_ACCESS(RPOR42_43,2)
// RPOR42_43<RPO42R3>
extern volatile __bit                   RPO42R3             __at(0x713B);	// @ (0xE27 * 8 + 3)
#define                                 RPO42R3_bit         _BIT_ACCESS(RPOR42_43,3)
// RPOR42_43<RPO43R0>
extern volatile __bit                   RPO43R0             __at(0x713C);	// @ (0xE27 * 8 + 4)
#define                                 RPO43R0_bit         _BIT_ACCESS(RPOR42_43,4)
// RPOR42_43<RPO43R1>
extern volatile __bit                   RPO43R1             __at(0x713D);	// @ (0xE27 * 8 + 5)
#define                                 RPO43R1_bit         _BIT_ACCESS(RPOR42_43,5)
// RPOR42_43<RPO43R2>
extern volatile __bit                   RPO43R2             __at(0x713E);	// @ (0xE27 * 8 + 6)
#define                                 RPO43R2_bit         _BIT_ACCESS(RPOR42_43,6)
// RPOR42_43<RPO43R3>
extern volatile __bit                   RPO43R3             __at(0x713F);	// @ (0xE27 * 8 + 7)
#define                                 RPO43R3_bit         _BIT_ACCESS(RPOR42_43,7)
// RPOR44_45<RPO44R0>
extern volatile __bit                   RPO44R0             __at(0x7140);	// @ (0xE28 * 8 + 0)
#define                                 RPO44R0_bit         _BIT_ACCESS(RPOR44_45,0)
// RPOR44_45<RPO44R1>
extern volatile __bit                   RPO44R1             __at(0x7141);	// @ (0xE28 * 8 + 1)
#define                                 RPO44R1_bit         _BIT_ACCESS(RPOR44_45,1)
// RPOR44_45<RPO44R2>
extern volatile __bit                   RPO44R2             __at(0x7142);	// @ (0xE28 * 8 + 2)
#define                                 RPO44R2_bit         _BIT_ACCESS(RPOR44_45,2)
// RPOR44_45<RPO44R3>
extern volatile __bit                   RPO44R3             __at(0x7143);	// @ (0xE28 * 8 + 3)
#define                                 RPO44R3_bit         _BIT_ACCESS(RPOR44_45,3)
// RPOR44_45<RPO45R0>
extern volatile __bit                   RPO45R0             __at(0x7144);	// @ (0xE28 * 8 + 4)
#define                                 RPO45R0_bit         _BIT_ACCESS(RPOR44_45,4)
// RPOR44_45<RPO45R1>
extern volatile __bit                   RPO45R1             __at(0x7145);	// @ (0xE28 * 8 + 5)
#define                                 RPO45R1_bit         _BIT_ACCESS(RPOR44_45,5)
// RPOR44_45<RPO45R2>
extern volatile __bit                   RPO45R2             __at(0x7146);	// @ (0xE28 * 8 + 6)
#define                                 RPO45R2_bit         _BIT_ACCESS(RPOR44_45,6)
// RPOR44_45<RPO45R3>
extern volatile __bit                   RPO45R3             __at(0x7147);	// @ (0xE28 * 8 + 7)
#define                                 RPO45R3_bit         _BIT_ACCESS(RPOR44_45,7)
// RPOR46<RPO46R0>
extern volatile __bit                   RPO46R0             __at(0x7148);	// @ (0xE29 * 8 + 0)
#define                                 RPO46R0_bit         _BIT_ACCESS(RPOR46,0)
// RPOR46<RPO46R1>
extern volatile __bit                   RPO46R1             __at(0x7149);	// @ (0xE29 * 8 + 1)
#define                                 RPO46R1_bit         _BIT_ACCESS(RPOR46,1)
// RPOR46<RPO46R2>
extern volatile __bit                   RPO46R2             __at(0x714A);	// @ (0xE29 * 8 + 2)
#define                                 RPO46R2_bit         _BIT_ACCESS(RPOR46,2)
// RPOR46<RPO46R3>
extern volatile __bit                   RPO46R3             __at(0x714B);	// @ (0xE29 * 8 + 3)
#define                                 RPO46R3_bit         _BIT_ACCESS(RPOR46,3)
// RPOR4_5<RPO4R0>
extern volatile __bit                   RPO4R0              __at(0x70A0);	// @ (0xE14 * 8 + 0)
#define                                 RPO4R0_bit          _BIT_ACCESS(RPOR4_5,0)
// RPOR4_5<RPO4R1>
extern volatile __bit                   RPO4R1              __at(0x70A1);	// @ (0xE14 * 8 + 1)
#define                                 RPO4R1_bit          _BIT_ACCESS(RPOR4_5,1)
// RPOR4_5<RPO4R2>
extern volatile __bit                   RPO4R2              __at(0x70A2);	// @ (0xE14 * 8 + 2)
#define                                 RPO4R2_bit          _BIT_ACCESS(RPOR4_5,2)
// RPOR4_5<RPO4R3>
extern volatile __bit                   RPO4R3              __at(0x70A3);	// @ (0xE14 * 8 + 3)
#define                                 RPO4R3_bit          _BIT_ACCESS(RPOR4_5,3)
// RPOR4_5<RPO5R0>
extern volatile __bit                   RPO5R0              __at(0x70A4);	// @ (0xE14 * 8 + 4)
#define                                 RPO5R0_bit          _BIT_ACCESS(RPOR4_5,4)
// RPOR4_5<RPO5R1>
extern volatile __bit                   RPO5R1              __at(0x70A5);	// @ (0xE14 * 8 + 5)
#define                                 RPO5R1_bit          _BIT_ACCESS(RPOR4_5,5)
// RPOR4_5<RPO5R2>
extern volatile __bit                   RPO5R2              __at(0x70A6);	// @ (0xE14 * 8 + 6)
#define                                 RPO5R2_bit          _BIT_ACCESS(RPOR4_5,6)
// RPOR4_5<RPO5R3>
extern volatile __bit                   RPO5R3              __at(0x70A7);	// @ (0xE14 * 8 + 7)
#define                                 RPO5R3_bit          _BIT_ACCESS(RPOR4_5,7)
// RPOR6_7<RPO6R0>
extern volatile __bit                   RPO6R0              __at(0x70A8);	// @ (0xE15 * 8 + 0)
#define                                 RPO6R0_bit          _BIT_ACCESS(RPOR6_7,0)
// RPOR6_7<RPO6R1>
extern volatile __bit                   RPO6R1              __at(0x70A9);	// @ (0xE15 * 8 + 1)
#define                                 RPO6R1_bit          _BIT_ACCESS(RPOR6_7,1)
// RPOR6_7<RPO6R2>
extern volatile __bit                   RPO6R2              __at(0x70AA);	// @ (0xE15 * 8 + 2)
#define                                 RPO6R2_bit          _BIT_ACCESS(RPOR6_7,2)
// RPOR6_7<RPO6R3>
extern volatile __bit                   RPO6R3              __at(0x70AB);	// @ (0xE15 * 8 + 3)
#define                                 RPO6R3_bit          _BIT_ACCESS(RPOR6_7,3)
// RPOR6_7<RPO7R0>
extern volatile __bit                   RPO7R0              __at(0x70AC);	// @ (0xE15 * 8 + 4)
#define                                 RPO7R0_bit          _BIT_ACCESS(RPOR6_7,4)
// RPOR6_7<RPO7R1>
extern volatile __bit                   RPO7R1              __at(0x70AD);	// @ (0xE15 * 8 + 5)
#define                                 RPO7R1_bit          _BIT_ACCESS(RPOR6_7,5)
// RPOR6_7<RPO7R2>
extern volatile __bit                   RPO7R2              __at(0x70AE);	// @ (0xE15 * 8 + 6)
#define                                 RPO7R2_bit          _BIT_ACCESS(RPOR6_7,6)
// RPOR6_7<RPO7R3>
extern volatile __bit                   RPO7R3              __at(0x70AF);	// @ (0xE15 * 8 + 7)
#define                                 RPO7R3_bit          _BIT_ACCESS(RPOR6_7,7)
// RPOR8_9<RPO8R0>
extern volatile __bit                   RPO8R0              __at(0x70B0);	// @ (0xE16 * 8 + 0)
#define                                 RPO8R0_bit          _BIT_ACCESS(RPOR8_9,0)
// RPOR8_9<RPO8R1>
extern volatile __bit                   RPO8R1              __at(0x70B1);	// @ (0xE16 * 8 + 1)
#define                                 RPO8R1_bit          _BIT_ACCESS(RPOR8_9,1)
// RPOR8_9<RPO8R2>
extern volatile __bit                   RPO8R2              __at(0x70B2);	// @ (0xE16 * 8 + 2)
#define                                 RPO8R2_bit          _BIT_ACCESS(RPOR8_9,2)
// RPOR8_9<RPO8R3>
extern volatile __bit                   RPO8R3              __at(0x70B3);	// @ (0xE16 * 8 + 3)
#define                                 RPO8R3_bit          _BIT_ACCESS(RPOR8_9,3)
// RPOR8_9<RPO9R0>
extern volatile __bit                   RPO9R0              __at(0x70B4);	// @ (0xE16 * 8 + 4)
#define                                 RPO9R0_bit          _BIT_ACCESS(RPOR8_9,4)
// RPOR8_9<RPO9R1>
extern volatile __bit                   RPO9R1              __at(0x70B5);	// @ (0xE16 * 8 + 5)
#define                                 RPO9R1_bit          _BIT_ACCESS(RPOR8_9,5)
// RPOR8_9<RPO9R2>
extern volatile __bit                   RPO9R2              __at(0x70B6);	// @ (0xE16 * 8 + 6)
#define                                 RPO9R2_bit          _BIT_ACCESS(RPOR8_9,6)
// RPOR8_9<RPO9R3>
extern volatile __bit                   RPO9R3              __at(0x70B7);	// @ (0xE16 * 8 + 7)
#define                                 RPO9R3_bit          _BIT_ACCESS(RPOR8_9,7)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<RSEN2>
extern volatile __bit                   RSEN2               __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 RSEN2_bit           _BIT_ACCESS(SSP2CON2,1)
// PIE3<RTCCIE>
extern volatile __bit                   RTCCIE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RTCCIE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<RTCCIF>
extern volatile __bit                   RTCCIF              __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 RTCCIF_bit          _BIT_ACCESS(PIR3,0)
// IPR3<RTCCIP>
extern volatile __bit                   RTCCIP              __at(0x7D28);	// @ (0xFA5 * 8 + 0)
#define                                 RTCCIP_bit          _BIT_ACCESS(IPR3,0)
// RTCCON2<RTCCLKSEL0>
extern volatile __bit                   RTCCLKSEL0          __at(0x7ABA);	// @ (0xF57 * 8 + 2)
#define                                 RTCCLKSEL0_bit      _BIT_ACCESS(RTCCON2,2)
// RTCCON2<RTCCLKSEL1>
extern volatile __bit                   RTCCLKSEL1          __at(0x7ABB);	// @ (0xF57 * 8 + 3)
#define                                 RTCCLKSEL1_bit      _BIT_ACCESS(RTCCON2,3)
// PMD3<RTCCMD>
extern volatile __bit                   RTCCMD              __at(0x778C);	// @ (0xEF1 * 8 + 4)
#define                                 RTCCMD_bit          _BIT_ACCESS(PMD3,4)
// RTCCON1<RTCEN>
extern volatile __bit                   RTCEN               __at(0x7AFF);	// @ (0xF5F * 8 + 7)
#define                                 RTCEN_bit           _BIT_ACCESS(RTCCON1,7)
// RTCCON1<RTCOE>
extern volatile __bit                   RTCOE               __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 RTCOE_bit           _BIT_ACCESS(RTCCON1,2)
// RTCCON1<RTCPTR0>
extern volatile __bit                   RTCPTR0             __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 RTCPTR0_bit         _BIT_ACCESS(RTCCON1,0)
// RTCCON1<RTCPTR1>
extern volatile __bit                   RTCPTR1             __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 RTCPTR1_bit         _BIT_ACCESS(RTCCON1,1)
// RTCCON2<RTCSECSEL0>
extern volatile __bit                   RTCSECSEL0          __at(0x7AB8);	// @ (0xF57 * 8 + 0)
#define                                 RTCSECSEL0_bit      _BIT_ACCESS(RTCCON2,0)
// RTCCON2<RTCSECSEL1>
extern volatile __bit                   RTCSECSEL1          __at(0x7AB9);	// @ (0xF57 * 8 + 1)
#define                                 RTCSECSEL1_bit      _BIT_ACCESS(RTCCON2,1)
// RTCCON1<RTCSYNC>
extern volatile __bit                   RTCSYNC             __at(0x7AFC);	// @ (0xF5F * 8 + 4)
#define                                 RTCSYNC_bit         _BIT_ACCESS(RTCCON1,4)
// DSCONH<RTCWDIS>
extern volatile __bit                   RTCWDIS             __at(0x7938);	// @ (0xF27 * 8 + 0)
#define                                 RTCWDIS_bit         _BIT_ACCESS(DSCONH,0)
// RTCCON1<RTCWREN>
extern volatile __bit                   RTCWREN             __at(0x7AFD);	// @ (0xF5F * 8 + 5)
#define                                 RTCWREN_bit         _BIT_ACCESS(RTCCON1,5)
// PORTVP<RVP0>
extern volatile __bit                   RVP0                __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 RVP0_bit            _BIT_ACCESS(PORTVP,0)
// PORTVP<RVP1>
extern volatile __bit                   RVP1                __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 RVP1_bit            _BIT_ACCESS(PORTVP,1)
// PORTVP<RVP2>
extern volatile __bit                   RVP2                __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 RVP2_bit            _BIT_ACCESS(PORTVP,2)
// PORTVP<RVP3>
extern volatile __bit                   RVP3                __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 RVP3_bit            _BIT_ACCESS(PORTVP,3)
// PORTVP<RVP4>
extern volatile __bit                   RVP4                __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 RVP4_bit            _BIT_ACCESS(PORTVP,4)
// PORTVP<RVP5>
extern volatile __bit                   RVP5                __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 RVP5_bit            _BIT_ACCESS(PORTVP,5)
// PORTVP<RVP6>
extern volatile __bit                   RVP6                __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 RVP6_bit            _BIT_ACCESS(PORTVP,6)
// PORTVP<RVP7>
extern volatile __bit                   RVP7                __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 RVP7_bit            _BIT_ACCESS(PORTVP,7)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<RW2>
extern volatile __bit                   RW2                 __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 RW2_bit             _BIT_ACCESS(SSP2STAT,2)
// RXADDRL<RXADDR0>
extern volatile __bit                   RXADDR0             __at(0x7B70);	// @ (0xF6E * 8 + 0)
#define                                 RXADDR0_bit         _BIT_ACCESS(RXADDRL,0)
// RXADDRL<RXADDR1>
extern volatile __bit                   RXADDR1             __at(0x7B71);	// @ (0xF6E * 8 + 1)
#define                                 RXADDR1_bit         _BIT_ACCESS(RXADDRL,1)
// RXADDRH<RXADDR10>
extern volatile __bit                   RXADDR10            __at(0x7B6A);	// @ (0xF6D * 8 + 2)
#define                                 RXADDR10_bit        _BIT_ACCESS(RXADDRH,2)
// RXADDRH<RXADDR11>
extern volatile __bit                   RXADDR11            __at(0x7B6B);	// @ (0xF6D * 8 + 3)
#define                                 RXADDR11_bit        _BIT_ACCESS(RXADDRH,3)
// RXADDRL<RXADDR2>
extern volatile __bit                   RXADDR2             __at(0x7B72);	// @ (0xF6E * 8 + 2)
#define                                 RXADDR2_bit         _BIT_ACCESS(RXADDRL,2)
// RXADDRL<RXADDR3>
extern volatile __bit                   RXADDR3             __at(0x7B73);	// @ (0xF6E * 8 + 3)
#define                                 RXADDR3_bit         _BIT_ACCESS(RXADDRL,3)
// RXADDRL<RXADDR4>
extern volatile __bit                   RXADDR4             __at(0x7B74);	// @ (0xF6E * 8 + 4)
#define                                 RXADDR4_bit         _BIT_ACCESS(RXADDRL,4)
// RXADDRL<RXADDR5>
extern volatile __bit                   RXADDR5             __at(0x7B75);	// @ (0xF6E * 8 + 5)
#define                                 RXADDR5_bit         _BIT_ACCESS(RXADDRL,5)
// RXADDRL<RXADDR6>
extern volatile __bit                   RXADDR6             __at(0x7B76);	// @ (0xF6E * 8 + 6)
#define                                 RXADDR6_bit         _BIT_ACCESS(RXADDRL,6)
// RXADDRL<RXADDR7>
extern volatile __bit                   RXADDR7             __at(0x7B77);	// @ (0xF6E * 8 + 7)
#define                                 RXADDR7_bit         _BIT_ACCESS(RXADDRL,7)
// RXADDRH<RXADDR8>
extern volatile __bit                   RXADDR8             __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 RXADDR8_bit         _BIT_ACCESS(RXADDRH,0)
// RXADDRH<RXADDR9>
extern volatile __bit                   RXADDR9             __at(0x7B69);	// @ (0xF6D * 8 + 1)
#define                                 RXADDR9_bit         _BIT_ACCESS(RXADDRH,1)
// PIE3<RXB0IE>
extern volatile __bit                   RXB0IE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RXB0IE_bit          _BIT_ACCESS(PIE3,0)
// PIE3<RXB1IE>
extern volatile __bit                   RXB1IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXB1IE_bit          _BIT_ACCESS(PIE3,1)
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXBNIE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 RXBNIF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 RXBNIP_bit          _BIT_ACCESS(IPR3,1)
// BAUDCON1<RXCKP>
extern volatile __bit                   RXCKP               __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 RXCKP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<RXDTP1>
extern volatile __bit                   RXDTP1              __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 RXDTP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<RXDTP2>
extern volatile __bit                   RXDTP2              __at(0x798D);	// @ (0xF31 * 8 + 5)
#define                                 RXDTP2_bit          _BIT_ACCESS(BAUDCON2,5)
// BAUDCON3<RXDTP3>
extern volatile __bit                   RXDTP3              __at(0x796D);	// @ (0xF2D * 8 + 5)
#define                                 RXDTP3_bit          _BIT_ACCESS(BAUDCON3,5)
// BAUDCON4<RXDTP4>
extern volatile __bit                   RXDTP4              __at(0x77ED);	// @ (0xEFD * 8 + 5)
#define                                 RXDTP4_bit          _BIT_ACCESS(BAUDCON4,5)
// DMACON1<RXINC>
extern volatile __bit                   RXINC               __at(0x7B04);	// @ (0xF60 * 8 + 4)
#define                                 RXINC_bit           _BIT_ACCESS(DMACON1,4)
// SSP1STAT<R_NOT_W1>
