MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J99/mcu.h
extern volatile __bit                   S29C2               __at(0x750D);	// @ (0xEA1 * 8 + 5)
#define                                 S29C2_bit           _BIT_ACCESS(LCDDATA19,5)
// LCDDATA27<S29C3>
extern volatile __bit                   S29C3               __at(0x754D);	// @ (0xEA9 * 8 + 5)
#define                                 S29C3_bit           _BIT_ACCESS(LCDDATA27,5)
// LCDDATA35<S29C4>
extern volatile __bit                   S29C4               __at(0x758D);	// @ (0xEB1 * 8 + 5)
#define                                 S29C4_bit           _BIT_ACCESS(LCDDATA35,5)
// LCDDATA43<S29C5>
extern volatile __bit                   S29C5               __at(0x75CD);	// @ (0xEB9 * 8 + 5)
#define                                 S29C5_bit           _BIT_ACCESS(LCDDATA43,5)
// LCDDATA51<S29C6>
extern volatile __bit                   S29C6               __at(0x760D);	// @ (0xEC1 * 8 + 5)
#define                                 S29C6_bit           _BIT_ACCESS(LCDDATA51,5)
// LCDDATA59<S29C7>
extern volatile __bit                   S29C7               __at(0x764D);	// @ (0xEC9 * 8 + 5)
#define                                 S29C7_bit           _BIT_ACCESS(LCDDATA59,5)
// LCDDATA3<S30C0>
extern volatile __bit                   S30C0               __at(0x748E);	// @ (0xE91 * 8 + 6)
#define                                 S30C0_bit           _BIT_ACCESS(LCDDATA3,6)
// LCDDATA11<S30C1>
extern volatile __bit                   S30C1               __at(0x74CE);	// @ (0xE99 * 8 + 6)
#define                                 S30C1_bit           _BIT_ACCESS(LCDDATA11,6)
// LCDDATA19<S30C2>
extern volatile __bit                   S30C2               __at(0x750E);	// @ (0xEA1 * 8 + 6)
#define                                 S30C2_bit           _BIT_ACCESS(LCDDATA19,6)
// LCDDATA27<S30C3>
extern volatile __bit                   S30C3               __at(0x754E);	// @ (0xEA9 * 8 + 6)
#define                                 S30C3_bit           _BIT_ACCESS(LCDDATA27,6)
// LCDDATA35<S30C4>
extern volatile __bit                   S30C4               __at(0x758E);	// @ (0xEB1 * 8 + 6)
#define                                 S30C4_bit           _BIT_ACCESS(LCDDATA35,6)
// LCDDATA43<S30C5>
extern volatile __bit                   S30C5               __at(0x75CE);	// @ (0xEB9 * 8 + 6)
#define                                 S30C5_bit           _BIT_ACCESS(LCDDATA43,6)
// LCDDATA51<S30C6>
extern volatile __bit                   S30C6               __at(0x760E);	// @ (0xEC1 * 8 + 6)
#define                                 S30C6_bit           _BIT_ACCESS(LCDDATA51,6)
// LCDDATA59<S30C7>
extern volatile __bit                   S30C7               __at(0x764E);	// @ (0xEC9 * 8 + 6)
#define                                 S30C7_bit           _BIT_ACCESS(LCDDATA59,6)
// LCDDATA3<S31C0>
extern volatile __bit                   S31C0               __at(0x748F);	// @ (0xE91 * 8 + 7)
#define                                 S31C0_bit           _BIT_ACCESS(LCDDATA3,7)
// LCDDATA11<S31C1>
extern volatile __bit                   S31C1               __at(0x74CF);	// @ (0xE99 * 8 + 7)
#define                                 S31C1_bit           _BIT_ACCESS(LCDDATA11,7)
// LCDDATA19<S31C2>
extern volatile __bit                   S31C2               __at(0x750F);	// @ (0xEA1 * 8 + 7)
#define                                 S31C2_bit           _BIT_ACCESS(LCDDATA19,7)
// LCDDATA27<S31C3>
extern volatile __bit                   S31C3               __at(0x754F);	// @ (0xEA9 * 8 + 7)
#define                                 S31C3_bit           _BIT_ACCESS(LCDDATA27,7)
// LCDDATA35<S31C4>
extern volatile __bit                   S31C4               __at(0x758F);	// @ (0xEB1 * 8 + 7)
#define                                 S31C4_bit           _BIT_ACCESS(LCDDATA35,7)
// LCDDATA43<S31C5>
extern volatile __bit                   S31C5               __at(0x75CF);	// @ (0xEB9 * 8 + 7)
#define                                 S31C5_bit           _BIT_ACCESS(LCDDATA43,7)
// LCDDATA51<S31C6>
extern volatile __bit                   S31C6               __at(0x760F);	// @ (0xEC1 * 8 + 7)
#define                                 S31C6_bit           _BIT_ACCESS(LCDDATA51,7)
// LCDDATA59<S31C7>
extern volatile __bit                   S31C7               __at(0x764F);	// @ (0xEC9 * 8 + 7)
#define                                 S31C7_bit           _BIT_ACCESS(LCDDATA59,7)
// LCDDATA4<S32C0>
extern volatile __bit                   S32C0               __at(0x7490);	// @ (0xE92 * 8 + 0)
#define                                 S32C0_bit           _BIT_ACCESS(LCDDATA4,0)
// LCDDATA12<S32C1>
extern volatile __bit                   S32C1               __at(0x74D0);	// @ (0xE9A * 8 + 0)
#define                                 S32C1_bit           _BIT_ACCESS(LCDDATA12,0)
// LCDDATA20<S32C2>
extern volatile __bit                   S32C2               __at(0x7510);	// @ (0xEA2 * 8 + 0)
#define                                 S32C2_bit           _BIT_ACCESS(LCDDATA20,0)
// LCDDATA28<S32C3>
extern volatile __bit                   S32C3               __at(0x7550);	// @ (0xEAA * 8 + 0)
#define                                 S32C3_bit           _BIT_ACCESS(LCDDATA28,0)
// LCDDATA36<S32C4>
extern volatile __bit                   S32C4               __at(0x7590);	// @ (0xEB2 * 8 + 0)
#define                                 S32C4_bit           _BIT_ACCESS(LCDDATA36,0)
// LCDDATA44<S32C5>
extern volatile __bit                   S32C5               __at(0x75D0);	// @ (0xEBA * 8 + 0)
#define                                 S32C5_bit           _BIT_ACCESS(LCDDATA44,0)
// LCDDATA52<S32C6>
extern volatile __bit                   S32C6               __at(0x7610);	// @ (0xEC2 * 8 + 0)
#define                                 S32C6_bit           _BIT_ACCESS(LCDDATA52,0)
// LCDDATA60<S32C7>
extern volatile __bit                   S32C7               __at(0x7650);	// @ (0xECA * 8 + 0)
#define                                 S32C7_bit           _BIT_ACCESS(LCDDATA60,0)
// LCDDATA4<S33C0>
extern volatile __bit                   S33C0               __at(0x7491);	// @ (0xE92 * 8 + 1)
#define                                 S33C0_bit           _BIT_ACCESS(LCDDATA4,1)
// LCDDATA12<S33C1>
extern volatile __bit                   S33C1               __at(0x74D1);	// @ (0xE9A * 8 + 1)
#define                                 S33C1_bit           _BIT_ACCESS(LCDDATA12,1)
// LCDDATA20<S33C2>
extern volatile __bit                   S33C2               __at(0x7511);	// @ (0xEA2 * 8 + 1)
#define                                 S33C2_bit           _BIT_ACCESS(LCDDATA20,1)
// LCDDATA28<S33C3>
extern volatile __bit                   S33C3               __at(0x7551);	// @ (0xEAA * 8 + 1)
#define                                 S33C3_bit           _BIT_ACCESS(LCDDATA28,1)
// LCDDATA36<S33C4>
extern volatile __bit                   S33C4               __at(0x7591);	// @ (0xEB2 * 8 + 1)
#define                                 S33C4_bit           _BIT_ACCESS(LCDDATA36,1)
// LCDDATA44<S33C5>
extern volatile __bit                   S33C5               __at(0x75D1);	// @ (0xEBA * 8 + 1)
#define                                 S33C5_bit           _BIT_ACCESS(LCDDATA44,1)
// LCDDATA52<S33C6>
extern volatile __bit                   S33C6               __at(0x7611);	// @ (0xEC2 * 8 + 1)
#define                                 S33C6_bit           _BIT_ACCESS(LCDDATA52,1)
// LCDDATA60<S33C7>
extern volatile __bit                   S33C7               __at(0x7651);	// @ (0xECA * 8 + 1)
#define                                 S33C7_bit           _BIT_ACCESS(LCDDATA60,1)
// LCDDATA4<S34C0>
extern volatile __bit                   S34C0               __at(0x7492);	// @ (0xE92 * 8 + 2)
#define                                 S34C0_bit           _BIT_ACCESS(LCDDATA4,2)
// LCDDATA12<S34C1>
extern volatile __bit                   S34C1               __at(0x74D2);	// @ (0xE9A * 8 + 2)
#define                                 S34C1_bit           _BIT_ACCESS(LCDDATA12,2)
// LCDDATA20<S34C2>
extern volatile __bit                   S34C2               __at(0x7512);	// @ (0xEA2 * 8 + 2)
#define                                 S34C2_bit           _BIT_ACCESS(LCDDATA20,2)
// LCDDATA28<S34C3>
extern volatile __bit                   S34C3               __at(0x7552);	// @ (0xEAA * 8 + 2)
#define                                 S34C3_bit           _BIT_ACCESS(LCDDATA28,2)
// LCDDATA36<S34C4>
extern volatile __bit                   S34C4               __at(0x7592);	// @ (0xEB2 * 8 + 2)
#define                                 S34C4_bit           _BIT_ACCESS(LCDDATA36,2)
// LCDDATA44<S34C5>
extern volatile __bit                   S34C5               __at(0x75D2);	// @ (0xEBA * 8 + 2)
#define                                 S34C5_bit           _BIT_ACCESS(LCDDATA44,2)
// LCDDATA52<S34C6>
extern volatile __bit                   S34C6               __at(0x7612);	// @ (0xEC2 * 8 + 2)
#define                                 S34C6_bit           _BIT_ACCESS(LCDDATA52,2)
// LCDDATA60<S34C7>
extern volatile __bit                   S34C7               __at(0x7652);	// @ (0xECA * 8 + 2)
#define                                 S34C7_bit           _BIT_ACCESS(LCDDATA60,2)
// LCDDATA4<S35C0>
extern volatile __bit                   S35C0               __at(0x7493);	// @ (0xE92 * 8 + 3)
#define                                 S35C0_bit           _BIT_ACCESS(LCDDATA4,3)
// LCDDATA12<S35C1>
extern volatile __bit                   S35C1               __at(0x74D3);	// @ (0xE9A * 8 + 3)
#define                                 S35C1_bit           _BIT_ACCESS(LCDDATA12,3)
// LCDDATA20<S35C2>
extern volatile __bit                   S35C2               __at(0x7513);	// @ (0xEA2 * 8 + 3)
#define                                 S35C2_bit           _BIT_ACCESS(LCDDATA20,3)
// LCDDATA28<S35C3>
extern volatile __bit                   S35C3               __at(0x7553);	// @ (0xEAA * 8 + 3)
#define                                 S35C3_bit           _BIT_ACCESS(LCDDATA28,3)
// LCDDATA36<S35C4>
extern volatile __bit                   S35C4               __at(0x7593);	// @ (0xEB2 * 8 + 3)
#define                                 S35C4_bit           _BIT_ACCESS(LCDDATA36,3)
// LCDDATA44<S35C5>
extern volatile __bit                   S35C5               __at(0x75D3);	// @ (0xEBA * 8 + 3)
#define                                 S35C5_bit           _BIT_ACCESS(LCDDATA44,3)
// LCDDATA52<S35C6>
extern volatile __bit                   S35C6               __at(0x7613);	// @ (0xEC2 * 8 + 3)
#define                                 S35C6_bit           _BIT_ACCESS(LCDDATA52,3)
// LCDDATA60<S35C7>
extern volatile __bit                   S35C7               __at(0x7653);	// @ (0xECA * 8 + 3)
#define                                 S35C7_bit           _BIT_ACCESS(LCDDATA60,3)
// LCDDATA4<S36C0>
extern volatile __bit                   S36C0               __at(0x7494);	// @ (0xE92 * 8 + 4)
#define                                 S36C0_bit           _BIT_ACCESS(LCDDATA4,4)
// LCDDATA12<S36C1>
extern volatile __bit                   S36C1               __at(0x74D4);	// @ (0xE9A * 8 + 4)
#define                                 S36C1_bit           _BIT_ACCESS(LCDDATA12,4)
// LCDDATA20<S36C2>
extern volatile __bit                   S36C2               __at(0x7514);	// @ (0xEA2 * 8 + 4)
#define                                 S36C2_bit           _BIT_ACCESS(LCDDATA20,4)
// LCDDATA28<S36C3>
extern volatile __bit                   S36C3               __at(0x7554);	// @ (0xEAA * 8 + 4)
#define                                 S36C3_bit           _BIT_ACCESS(LCDDATA28,4)
// LCDDATA36<S36C4>
extern volatile __bit                   S36C4               __at(0x7594);	// @ (0xEB2 * 8 + 4)
#define                                 S36C4_bit           _BIT_ACCESS(LCDDATA36,4)
// LCDDATA44<S36C5>
extern volatile __bit                   S36C5               __at(0x75D4);	// @ (0xEBA * 8 + 4)
#define                                 S36C5_bit           _BIT_ACCESS(LCDDATA44,4)
// LCDDATA52<S36C6>
extern volatile __bit                   S36C6               __at(0x7614);	// @ (0xEC2 * 8 + 4)
#define                                 S36C6_bit           _BIT_ACCESS(LCDDATA52,4)
// LCDDATA60<S36C7>
extern volatile __bit                   S36C7               __at(0x7654);	// @ (0xECA * 8 + 4)
#define                                 S36C7_bit           _BIT_ACCESS(LCDDATA60,4)
// LCDDATA4<S37C0>
extern volatile __bit                   S37C0               __at(0x7495);	// @ (0xE92 * 8 + 5)
#define                                 S37C0_bit           _BIT_ACCESS(LCDDATA4,5)
// LCDDATA12<S37C1>
extern volatile __bit                   S37C1               __at(0x74D5);	// @ (0xE9A * 8 + 5)
#define                                 S37C1_bit           _BIT_ACCESS(LCDDATA12,5)
// LCDDATA20<S37C2>
extern volatile __bit                   S37C2               __at(0x7515);	// @ (0xEA2 * 8 + 5)
#define                                 S37C2_bit           _BIT_ACCESS(LCDDATA20,5)
// LCDDATA28<S37C3>
extern volatile __bit                   S37C3               __at(0x7555);	// @ (0xEAA * 8 + 5)
#define                                 S37C3_bit           _BIT_ACCESS(LCDDATA28,5)
// LCDDATA36<S37C4>
extern volatile __bit                   S37C4               __at(0x7595);	// @ (0xEB2 * 8 + 5)
#define                                 S37C4_bit           _BIT_ACCESS(LCDDATA36,5)
// LCDDATA44<S37C5>
extern volatile __bit                   S37C5               __at(0x75D5);	// @ (0xEBA * 8 + 5)
#define                                 S37C5_bit           _BIT_ACCESS(LCDDATA44,5)
// LCDDATA52<S37C6>
extern volatile __bit                   S37C6               __at(0x7615);	// @ (0xEC2 * 8 + 5)
#define                                 S37C6_bit           _BIT_ACCESS(LCDDATA52,5)
// LCDDATA60<S37C7>
extern volatile __bit                   S37C7               __at(0x7655);	// @ (0xECA * 8 + 5)
#define                                 S37C7_bit           _BIT_ACCESS(LCDDATA60,5)
// LCDDATA4<S38C0>
extern volatile __bit                   S38C0               __at(0x7496);	// @ (0xE92 * 8 + 6)
#define                                 S38C0_bit           _BIT_ACCESS(LCDDATA4,6)
// LCDDATA12<S38C1>
extern volatile __bit                   S38C1               __at(0x74D6);	// @ (0xE9A * 8 + 6)
#define                                 S38C1_bit           _BIT_ACCESS(LCDDATA12,6)
// LCDDATA20<S38C2>
extern volatile __bit                   S38C2               __at(0x7516);	// @ (0xEA2 * 8 + 6)
#define                                 S38C2_bit           _BIT_ACCESS(LCDDATA20,6)
// LCDDATA28<S38C3>
extern volatile __bit                   S38C3               __at(0x7556);	// @ (0xEAA * 8 + 6)
#define                                 S38C3_bit           _BIT_ACCESS(LCDDATA28,6)
// LCDDATA36<S38C4>
extern volatile __bit                   S38C4               __at(0x7596);	// @ (0xEB2 * 8 + 6)
#define                                 S38C4_bit           _BIT_ACCESS(LCDDATA36,6)
// LCDDATA44<S38C5>
extern volatile __bit                   S38C5               __at(0x75D6);	// @ (0xEBA * 8 + 6)
#define                                 S38C5_bit           _BIT_ACCESS(LCDDATA44,6)
// LCDDATA52<S38C6>
extern volatile __bit                   S38C6               __at(0x7616);	// @ (0xEC2 * 8 + 6)
#define                                 S38C6_bit           _BIT_ACCESS(LCDDATA52,6)
// LCDDATA60<S38C7>
extern volatile __bit                   S38C7               __at(0x7656);	// @ (0xECA * 8 + 6)
#define                                 S38C7_bit           _BIT_ACCESS(LCDDATA60,6)
// LCDDATA4<S39C0>
extern volatile __bit                   S39C0               __at(0x7497);	// @ (0xE92 * 8 + 7)
#define                                 S39C0_bit           _BIT_ACCESS(LCDDATA4,7)
// LCDDATA12<S39C1>
extern volatile __bit                   S39C1               __at(0x74D7);	// @ (0xE9A * 8 + 7)
#define                                 S39C1_bit           _BIT_ACCESS(LCDDATA12,7)
// LCDDATA20<S39C2>
extern volatile __bit                   S39C2               __at(0x7517);	// @ (0xEA2 * 8 + 7)
#define                                 S39C2_bit           _BIT_ACCESS(LCDDATA20,7)
// LCDDATA28<S39C3>
extern volatile __bit                   S39C3               __at(0x7557);	// @ (0xEAA * 8 + 7)
#define                                 S39C3_bit           _BIT_ACCESS(LCDDATA28,7)
// LCDDATA36<S39C4>
extern volatile __bit                   S39C4               __at(0x7597);	// @ (0xEB2 * 8 + 7)
#define                                 S39C4_bit           _BIT_ACCESS(LCDDATA36,7)
// LCDDATA44<S39C5>
extern volatile __bit                   S39C5               __at(0x75D7);	// @ (0xEBA * 8 + 7)
#define                                 S39C5_bit           _BIT_ACCESS(LCDDATA44,7)
// LCDDATA52<S39C6>
extern volatile __bit                   S39C6               __at(0x7617);	// @ (0xEC2 * 8 + 7)
#define                                 S39C6_bit           _BIT_ACCESS(LCDDATA52,7)
// LCDDATA60<S39C7>
extern volatile __bit                   S39C7               __at(0x7657);	// @ (0xECA * 8 + 7)
#define                                 S39C7_bit           _BIT_ACCESS(LCDDATA60,7)
// LCDDATA5<S40C0>
extern volatile __bit                   S40C0               __at(0x7498);	// @ (0xE93 * 8 + 0)
#define                                 S40C0_bit           _BIT_ACCESS(LCDDATA5,0)
// LCDDATA13<S40C1>
extern volatile __bit                   S40C1               __at(0x74D8);	// @ (0xE9B * 8 + 0)
#define                                 S40C1_bit           _BIT_ACCESS(LCDDATA13,0)
// LCDDATA5<S40C15>
extern volatile __bit                   S40C15              __at(0x7498);	// @ (0xE93 * 8 + 0)
#define                                 S40C15_bit          _BIT_ACCESS(LCDDATA5,0)
// LCDDATA21<S40C2>
extern volatile __bit                   S40C2               __at(0x7518);	// @ (0xEA3 * 8 + 0)
#define                                 S40C2_bit           _BIT_ACCESS(LCDDATA21,0)
// LCDDATA29<S40C3>
extern volatile __bit                   S40C3               __at(0x7558);	// @ (0xEAB * 8 + 0)
#define                                 S40C3_bit           _BIT_ACCESS(LCDDATA29,0)
// LCDDATA37<S40C4>
extern volatile __bit                   S40C4               __at(0x7598);	// @ (0xEB3 * 8 + 0)
#define                                 S40C4_bit           _BIT_ACCESS(LCDDATA37,0)
// LCDDATA45<S40C5>
extern volatile __bit                   S40C5               __at(0x75D8);	// @ (0xEBB * 8 + 0)
#define                                 S40C5_bit           _BIT_ACCESS(LCDDATA45,0)
// LCDDATA53<S40C6>
extern volatile __bit                   S40C6               __at(0x7618);	// @ (0xEC3 * 8 + 0)
#define                                 S40C6_bit           _BIT_ACCESS(LCDDATA53,0)
// LCDDATA61<S40C7>
extern volatile __bit                   S40C7               __at(0x7658);	// @ (0xECB * 8 + 0)
#define                                 S40C7_bit           _BIT_ACCESS(LCDDATA61,0)
// LCDDATA5<S41C0>
extern volatile __bit                   S41C0               __at(0x7499);	// @ (0xE93 * 8 + 1)
#define                                 S41C0_bit           _BIT_ACCESS(LCDDATA5,1)
// LCDDATA13<S41C1>
extern volatile __bit                   S41C1               __at(0x74D9);	// @ (0xE9B * 8 + 1)
#define                                 S41C1_bit           _BIT_ACCESS(LCDDATA13,1)
// LCDDATA21<S41C2>
extern volatile __bit                   S41C2               __at(0x7519);	// @ (0xEA3 * 8 + 1)
#define                                 S41C2_bit           _BIT_ACCESS(LCDDATA21,1)
// LCDDATA29<S41C3>
extern volatile __bit                   S41C3               __at(0x7559);	// @ (0xEAB * 8 + 1)
#define                                 S41C3_bit           _BIT_ACCESS(LCDDATA29,1)
// LCDDATA37<S41C4>
extern volatile __bit                   S41C4               __at(0x7599);	// @ (0xEB3 * 8 + 1)
#define                                 S41C4_bit           _BIT_ACCESS(LCDDATA37,1)
// LCDDATA45<S41C5>
extern volatile __bit                   S41C5               __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 S41C5_bit           _BIT_ACCESS(LCDDATA45,1)
// LCDDATA53<S41C6>
extern volatile __bit                   S41C6               __at(0x7619);	// @ (0xEC3 * 8 + 1)
#define                                 S41C6_bit           _BIT_ACCESS(LCDDATA53,1)
// LCDDATA61<S41C7>
extern volatile __bit                   S41C7               __at(0x7659);	// @ (0xECB * 8 + 1)
#define                                 S41C7_bit           _BIT_ACCESS(LCDDATA61,1)
// LCDDATA5<S42C0>
extern volatile __bit                   S42C0               __at(0x749A);	// @ (0xE93 * 8 + 2)
#define                                 S42C0_bit           _BIT_ACCESS(LCDDATA5,2)
// LCDDATA13<S42C1>
extern volatile __bit                   S42C1               __at(0x74DA);	// @ (0xE9B * 8 + 2)
#define                                 S42C1_bit           _BIT_ACCESS(LCDDATA13,2)
// LCDDATA21<S42C2>
extern volatile __bit                   S42C2               __at(0x751A);	// @ (0xEA3 * 8 + 2)
#define                                 S42C2_bit           _BIT_ACCESS(LCDDATA21,2)
// LCDDATA29<S42C3>
extern volatile __bit                   S42C3               __at(0x755A);	// @ (0xEAB * 8 + 2)
#define                                 S42C3_bit           _BIT_ACCESS(LCDDATA29,2)
// LCDDATA37<S42C4>
extern volatile __bit                   S42C4               __at(0x759A);	// @ (0xEB3 * 8 + 2)
#define                                 S42C4_bit           _BIT_ACCESS(LCDDATA37,2)
// LCDDATA45<S42C5>
extern volatile __bit                   S42C5               __at(0x75DA);	// @ (0xEBB * 8 + 2)
#define                                 S42C5_bit           _BIT_ACCESS(LCDDATA45,2)
// LCDDATA53<S42C6>
extern volatile __bit                   S42C6               __at(0x761A);	// @ (0xEC3 * 8 + 2)
#define                                 S42C6_bit           _BIT_ACCESS(LCDDATA53,2)
// LCDDATA61<S42C7>
extern volatile __bit                   S42C7               __at(0x765A);	// @ (0xECB * 8 + 2)
#define                                 S42C7_bit           _BIT_ACCESS(LCDDATA61,2)
// LCDDATA5<S43C0>
extern volatile __bit                   S43C0               __at(0x749B);	// @ (0xE93 * 8 + 3)
#define                                 S43C0_bit           _BIT_ACCESS(LCDDATA5,3)
// LCDDATA13<S43C1>
extern volatile __bit                   S43C1               __at(0x74DB);	// @ (0xE9B * 8 + 3)
#define                                 S43C1_bit           _BIT_ACCESS(LCDDATA13,3)
// LCDDATA21<S43C2>
extern volatile __bit                   S43C2               __at(0x751B);	// @ (0xEA3 * 8 + 3)
#define                                 S43C2_bit           _BIT_ACCESS(LCDDATA21,3)
// LCDDATA29<S43C3>
extern volatile __bit                   S43C3               __at(0x755B);	// @ (0xEAB * 8 + 3)
#define                                 S43C3_bit           _BIT_ACCESS(LCDDATA29,3)
// LCDDATA37<S43C4>
extern volatile __bit                   S43C4               __at(0x759B);	// @ (0xEB3 * 8 + 3)
#define                                 S43C4_bit           _BIT_ACCESS(LCDDATA37,3)
// LCDDATA45<S43C5>
extern volatile __bit                   S43C5               __at(0x75DB);	// @ (0xEBB * 8 + 3)
#define                                 S43C5_bit           _BIT_ACCESS(LCDDATA45,3)
// LCDDATA53<S43C6>
extern volatile __bit                   S43C6               __at(0x761B);	// @ (0xEC3 * 8 + 3)
#define                                 S43C6_bit           _BIT_ACCESS(LCDDATA53,3)
// LCDDATA61<S43C7>
extern volatile __bit                   S43C7               __at(0x765B);	// @ (0xECB * 8 + 3)
#define                                 S43C7_bit           _BIT_ACCESS(LCDDATA61,3)
// LCDDATA5<S44C0>
extern volatile __bit                   S44C0               __at(0x749C);	// @ (0xE93 * 8 + 4)
#define                                 S44C0_bit           _BIT_ACCESS(LCDDATA5,4)
// LCDDATA13<S44C1>
